{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "e564957a",
   "metadata": {},
   "source": [
    "\n",
    "# Tik tok "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "443fb853",
   "metadata": {},
   "source": [
    "Throughout this code we will carry out an analysis of the database related to TikTok and its contents related to the war in Ukraine. After analyzing the complete graph in a more general way, we will focus on the behavior of the most popular profiles related to news and how they transmit information through a sensitivity analysis of their content. In addition, we will also study the network of recommendations that TikTok generates from these profiles, to check if there is any pattern or trend under its algorithm."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "cfbc0cde",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import numpy as np\n",
    "from py2neo import Graph\n",
    "from py2neo import Node\n",
    "from py2neo import Relationship\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "# for some nlp secret sauce\n",
    "import nltk\n",
    "from textblob import TextBlob\n",
    "from textblob.sentiments import NaiveBayesAnalyzer\n",
    "from langdetect import detect_langs\n",
    "from langdetect import detect\n",
    "from nltk.sentiment.vader import SentimentIntensityAnalyzer\n",
    "# Wordcloud stuff\n",
    "from PIL import Image\n",
    "from wordcloud import WordCloud, ImageColorGenerator, STOPWORDS\n",
    "import matplotlib as plt\n",
    "from nltk.corpus import stopwords\n",
    "from nltk import word_tokenize\n",
    "from nltk import FreqDist\n",
    "from googletrans import Translator, constants\n",
    "from pprint import pprint\n",
    "#print(stopwords.fileids())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6ac5a3da",
   "metadata": {},
   "outputs": [],
   "source": [
    "# update bolt port number and password as needed.\n",
    "# in Neo4j, start DB of choice, click on DB name, on right under Details tab note 'Bolt port'\n",
    "# Windows\n",
    "if os.name == 'nt':\n",
    "    graph = Graph(\"bolt://localhost:7687\", password='xxxx', name='neo4j')\n",
    "# Linux & Mac\n",
    "if os.name == 'posix':\n",
    "    graph = Graph(\"bolt://localhost:11003\", password='xxxx', name='neo4j')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4ffc3ad1",
   "metadata": {},
   "source": [
    "The graphic representations will always look better in neo4j, which is where they had been implemented, but it is collected here theoretically"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a06b0377",
   "metadata": {},
   "source": [
    "## Centrality Measures\n",
    "<A HREF=\"https://neo4j-website.s3.eu-central-1.amazonaws.com/build/html/Algorithms/centrality/centrality.html\">Centrality Measures</A>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "56c6a5a5",
   "metadata": {},
   "source": [
    "First,we should install <A HREF=\"https://neo4j.com/labs/apoc/4.1/installation/\">APOC</A> and Graph Data Science Library in the Tik Tok database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "59d583ba",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>nodes</th><th>relationships</th></tr><tr><td style=\"text-align:left\">[(_-8:song {constraints: [], indexes: [], name: &#039;song&#039;}), (_-5:video {constraints: [], indexes: [], name: &#039;video&#039;}), (_-7:tag {constraints: [], indexes: [], name: &#039;tag&#039;}), (_-6:user {constraints: [], indexes: [&#039;id&#039;], name: &#039;user&#039;})]</td><td style=\"text-align:left\">[(_-6)-[:author {}]-&gt;(_-5), (_-6)-[:author {}]-&gt;(_-8), (_-5)-[:has {}]-&gt;(_-7), (_-5)-[:has {}]-&gt;(_-8), (_-6)-[:recommends {}]-&gt;(_-5), (_-6)-[:recommends {}]-&gt;(_-6), (_-5)-[:recommends {}]-&gt;(_-5), (_-5)-[:recommends {}]-&gt;(_-6)]</td></tr></table>"
      ],
      "text/plain": [
       " nodes                                                                                                                                                                                                                                    | relationships                                                                                                                                                                                                                      \n",
       "------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
       " [(_-8:song {constraints: [], indexes: [], name: 'song'}), (_-5:video {constraints: [], indexes: [], name: 'video'}), (_-7:tag {constraints: [], indexes: [], name: 'tag'}), (_-6:user {constraints: [], indexes: ['id'], name: 'user'})] | [(_-6)-[:author {}]->(_-5), (_-6)-[:author {}]->(_-8), (_-5)-[:has {}]->(_-7), (_-5)-[:has {}]->(_-8), (_-6)-[:recommends {}]->(_-5), (_-6)-[:recommends {}]->(_-6), (_-5)-[:recommends {}]->(_-5), (_-5)-[:recommends {}]->(_-6)] "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Graph structure\n",
    "query = \"\"\"\n",
    "CALL db.schema.visualization()\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "8f469bab",
   "metadata": {},
   "outputs": [
    {
     "ename": "ClientError",
     "evalue": "[Procedure.ProcedureNotFound] There is no procedure with the name `gds.alpha.closeness.stream` registered for this database instance. Please ensure you've spelled the procedure name correctly and that the procedure is properly deployed.",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mClientError\u001b[0m                               Traceback (most recent call last)",
      "Input \u001b[1;32mIn [70]\u001b[0m, in \u001b[0;36m<cell line: 13>\u001b[1;34m()\u001b[0m\n\u001b[0;32m      1\u001b[0m \u001b[38;5;66;03m#Accounts with highest centrality score\u001b[39;00m\n\u001b[0;32m      2\u001b[0m query \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\"\"\u001b[39m\n\u001b[0;32m      3\u001b[0m \u001b[38;5;124mCALL gds.alpha.closeness.stream(\u001b[39m\u001b[38;5;124m{\u001b[39m\n\u001b[0;32m      4\u001b[0m \u001b[38;5;124m    nodeProjection: \u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124muser\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m,\u001b[39m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m     11\u001b[0m \u001b[38;5;124mORDER BY centrality DESC;\u001b[39m\n\u001b[0;32m     12\u001b[0m \u001b[38;5;124m\"\"\"\u001b[39m\n\u001b[1;32m---> 13\u001b[0m result\u001b[38;5;241m=\u001b[39m\u001b[43mgraph\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     14\u001b[0m centrality \u001b[38;5;241m=\u001b[39m result\u001b[38;5;241m.\u001b[39mto_data_frame()\n\u001b[0;32m     15\u001b[0m centrality\u001b[38;5;241m.\u001b[39mhead(\u001b[38;5;241m10\u001b[39m)\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\py2neo\\database.py:405\u001b[0m, in \u001b[0;36mGraph.run\u001b[1;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[0;32m    395\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mrun\u001b[39m(\u001b[38;5;28mself\u001b[39m, cypher, parameters\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwparameters):\n\u001b[0;32m    396\u001b[0m     \u001b[38;5;124;03m\"\"\" Run a single read/write query within an auto-commit\u001b[39;00m\n\u001b[0;32m    397\u001b[0m \u001b[38;5;124;03m    :class:`~py2neo.Transaction`.\u001b[39;00m\n\u001b[0;32m    398\u001b[0m \n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    403\u001b[0m \u001b[38;5;124;03m    :return:\u001b[39;00m\n\u001b[0;32m    404\u001b[0m \u001b[38;5;124;03m    \"\"\"\u001b[39;00m\n\u001b[1;32m--> 405\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mauto()\u001b[38;5;241m.\u001b[39mrun(cypher, parameters, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwparameters)\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\py2neo\\database.py:992\u001b[0m, in \u001b[0;36mTransaction.run\u001b[1;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[0;32m    988\u001b[0m     \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[0;32m    989\u001b[0m         result \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connector\u001b[38;5;241m.\u001b[39mauto_run(cypher, parameters,\n\u001b[0;32m    990\u001b[0m                                           graph_name\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mgraph\u001b[38;5;241m.\u001b[39mname,\n\u001b[0;32m    991\u001b[0m                                           readonly\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mreadonly)\n\u001b[1;32m--> 992\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connector\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpull\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresult\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m-\u001b[39;49m\u001b[38;5;241;43m1\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[0;32m    993\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m Cursor(result, hydrant)\n\u001b[0;32m    994\u001b[0m \u001b[38;5;28;01mfinally\u001b[39;00m:\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\py2neo\\client\\__init__.py:1434\u001b[0m, in \u001b[0;36mConnector.pull\u001b[1;34m(self, result, n)\u001b[0m\n\u001b[0;32m   1432\u001b[0m cx \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_reacquire(result\u001b[38;5;241m.\u001b[39mtransaction)\n\u001b[0;32m   1433\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m-> 1434\u001b[0m     \u001b[43mcx\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpull\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresult\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mn\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mn\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m   1435\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ConnectionUnavailable, ConnectionBroken):\n\u001b[0;32m   1436\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprune(cx\u001b[38;5;241m.\u001b[39mprofile)\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\py2neo\\client\\bolt.py:1001\u001b[0m, in \u001b[0;36mBolt4x0.pull\u001b[1;34m(self, result, n, capacity)\u001b[0m\n\u001b[0;32m    998\u001b[0m     raise_from(ConnectionBroken(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mTransaction broken by disconnection \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m    999\u001b[0m                                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mduring pull\u001b[39m\u001b[38;5;124m\"\u001b[39m), error)\n\u001b[0;32m   1000\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m-> 1001\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_audit\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_transaction\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m   1002\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m response\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\py2neo\\client\\bolt.py:810\u001b[0m, in \u001b[0;36mBolt1._audit\u001b[1;34m(self, task)\u001b[0m\n\u001b[0;32m    808\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m\n\u001b[0;32m    809\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 810\u001b[0m     \u001b[43mtask\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43maudit\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    811\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m Neo4jError:\n\u001b[0;32m    812\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mreset(force\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mTrue\u001b[39;00m)\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\py2neo\\client\\bolt.py:1140\u001b[0m, in \u001b[0;36mItemizedTask.audit\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m   1138\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21maudit\u001b[39m(\u001b[38;5;28mself\u001b[39m):\n\u001b[0;32m   1139\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m item \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_items:\n\u001b[1;32m-> 1140\u001b[0m         \u001b[43mitem\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43maudit\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\py2neo\\client\\bolt.py:1140\u001b[0m, in \u001b[0;36mItemizedTask.audit\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m   1138\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21maudit\u001b[39m(\u001b[38;5;28mself\u001b[39m):\n\u001b[0;32m   1139\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m item \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_items:\n\u001b[1;32m-> 1140\u001b[0m         \u001b[43mitem\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43maudit\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\py2neo\\client\\bolt.py:1303\u001b[0m, in \u001b[0;36mBoltResponse.audit\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m   1301\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_failure:\n\u001b[0;32m   1302\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mset_ignored()\n\u001b[1;32m-> 1303\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_failure\n",
      "\u001b[1;31mClientError\u001b[0m: [Procedure.ProcedureNotFound] There is no procedure with the name `gds.alpha.closeness.stream` registered for this database instance. Please ensure you've spelled the procedure name correctly and that the procedure is properly deployed."
     ]
    }
   ],
   "source": [
    "#Accounts with highest centrality score\n",
    "query = \"\"\"\n",
    "CALL gds.alpha.closeness.stream({\n",
    "    nodeProjection: \"user\",\n",
    "    relationshipProjection: \"recommends\"\n",
    "})\n",
    "YIELD nodeId, centrality\n",
    "RETURN gds.util.asNode(nodeId).id AS name,\n",
    "       gds.util.asNode(nodeId).followerCount AS followerCount,\n",
    "       centrality AS centralScore\n",
    "ORDER BY centrality DESC;\n",
    "\"\"\"\n",
    "result=graph.run(query)\n",
    "centrality = result.to_data_frame()\n",
    "centrality.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "58e965a2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Counties with highest betweeness score\n",
    "query = \"\"\"\n",
    "CALL gds.betweenness.stream({\n",
    "    nodeProjection: \"user\",\n",
    "    relationshipProjection: \"recommends\"\n",
    "})\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).id AS name,\n",
    "       gds.util.asNode(nodeId).followerCount AS followerCount,\n",
    "       score AS btwnScore\n",
    "ORDER BY score DESC;\n",
    "\"\"\"\n",
    "result=graph.run(query)\n",
    "betweeness = result.to_data_frame()\n",
    "betweeness.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "12dcf7dd",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Counties with highest page rank score\n",
    "query = \"\"\"\n",
    "CALL gds.pageRank.stream({  \n",
    "    nodeProjection: \"user\",\n",
    "    relationshipProjection: \"recommends\",  \n",
    "    maxIterations: 50,  dampingFactor: 0.85})\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).id AS name, \n",
    "       gds.util.asNode(nodeId).followerCount AS followerCount,\n",
    "       score AS pageRank\n",
    "ORDER BY score DESC;\n",
    "\"\"\"\n",
    "result=graph.run(query)\n",
    "pagerank = result.to_data_frame()\n",
    "pagerank.head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e53bfc5",
   "metadata": {},
   "source": [
    "# Popularity analysis"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c6cdc521",
   "metadata": {},
   "source": [
    "From here we will analyze the most popular news accounts that create content related to the Ukraine war. But the first thing we have to define is: what do we consider a popular account?\n",
    "\n",
    "Aside from popularity, one feature that can tell us a lot about the content creator is whether or not the account is verified by TikTok. Although this does not have to directly imply that the information provided by the account is more rigorous, it requires something more serious and defines that the content creator has been, at least, identified by the platform. Therefore, throughout the code, this will be one of the most present variables.\n",
    "\n",
    "Below we present a set of different data frames, in which we organize these profiles according to likes,followers and views, filtering these accounts by the presence of \"news\" in their name. A more in-depth process will be carried out once we decide on the criteria to follow."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e6d79c46",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>LikesReceived</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>153400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>yahoonews</td>\n",
       "      <td>97800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>nbcnews</td>\n",
       "      <td>79200000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>underthedesknews</td>\n",
       "      <td>76600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>nikocadodailynews</td>\n",
       "      <td>71100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>donald_newshd</td>\n",
       "      <td>67000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>.thenewwave</td>\n",
       "      <td>54300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>news.com.au</td>\n",
       "      <td>51700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>switchy._.news</td>\n",
       "      <td>39700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>kingqurannewpage</td>\n",
       "      <td>34900000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            userName  LikesReceived\n",
       "0            cbsnews      153400000\n",
       "1          yahoonews       97800000\n",
       "2            nbcnews       79200000\n",
       "3   underthedesknews       76600000\n",
       "4  nikocadodailynews       71100000\n",
       "5      donald_newshd       67000000\n",
       "6        .thenewwave       54300000\n",
       "7        news.com.au       51700000\n",
       "8     switchy._.news       39700000\n",
       "9   kingqurannewpage       34900000"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#News accounts sorted by likes\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id =~ '.*new.*'\n",
    "RETURN DISTINCT u.id AS userName, u.heartCount as LikesReceived\n",
    "ORDER BY LikesReceived DESC \n",
    "\"\"\"\n",
    "lista=pd.DataFrame(graph.run(query).data())\n",
    "lista.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "392b4cea",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>Followers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>nbcnews</td>\n",
       "      <td>2700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>2500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>underthedesknews</td>\n",
       "      <td>2300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>abcnews</td>\n",
       "      <td>2100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>yahoonews</td>\n",
       "      <td>1700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>kingqurannewpage</td>\n",
       "      <td>1700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>.thenewwave</td>\n",
       "      <td>1700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>nikocadodailynews</td>\n",
       "      <td>1700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>donald_newshd</td>\n",
       "      <td>1400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>1300000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            userName  Followers\n",
       "0            nbcnews    2700000\n",
       "1            cbsnews    2500000\n",
       "2   underthedesknews    2300000\n",
       "3            abcnews    2100000\n",
       "4          yahoonews    1700000\n",
       "5   kingqurannewpage    1700000\n",
       "6        .thenewwave    1700000\n",
       "7  nikocadodailynews    1700000\n",
       "8      donald_newshd    1400000\n",
       "9      viceworldnews    1300000"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#News accounts sorted by followers\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id =~ '.*new.*'\n",
    "RETURN DISTINCT u.id AS userName, u.followerCount as Followers\n",
    "ORDER BY Followers DESC ;\n",
    "\"\"\"\n",
    "lista=pd.DataFrame(graph.run(query).data())\n",
    "lista.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "4a6a045f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>nbcnews</td>\n",
       "      <td>126478400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>nikocadodailynews</td>\n",
       "      <td>114467700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>news.com.au</td>\n",
       "      <td>98309800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>86062900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>kingqurannewpage</td>\n",
       "      <td>53900000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>52198548</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>48264300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>skynews</td>\n",
       "      <td>44466903</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>mednews22</td>\n",
       "      <td>41500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>donald_newshd</td>\n",
       "      <td>32900000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             userName    Streams\n",
       "0             nbcnews  126478400\n",
       "1   nikocadodailynews  114467700\n",
       "2         news.com.au   98309800\n",
       "3       viceworldnews   86062900\n",
       "4    kingqurannewpage   53900000\n",
       "5             cbsnews   52198548\n",
       "6  bikini.bottom.news   48264300\n",
       "7             skynews   44466903\n",
       "8           mednews22   41500000\n",
       "9       donald_newshd   32900000"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#News accounts sorted by streamings\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id =~ '.*new.*'\n",
    "RETURN  u.id AS userName, sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\"\n",
    "lista=pd.DataFrame(graph.run(query).data())\n",
    "lista.head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dbfeff23",
   "metadata": {},
   "source": [
    "As we can see, the order of the lists changes considerably depending on the criteria we follow. \n",
    "\n",
    "Tiktok is a platform whose activity is based on the consumption of content from the \"For you\" page. This content does not appear randomly or chronologically, but based on the behavior of the user with respect to the content that is presented to him. This provides information to a powerful recommendation algorithm, which as the user spends more time on the platform, adjusts the content to the one with which the user has interacted the most. Because of all this, users rarely follow many accounts, they don't need it since the content they are interested in appears on their screen anyway. As a consequence of this implementation, we have chosen that the method to classify the popularity of an account is based on the reproductions of its videos related to this theme, since the higher, it will mean that it appears in more \"For you\" pages.\n",
    "\n",
    "Next we will look for the accounts that produce videos in which the word \"news\" is mentioned, both in the name of the profile and in the description of one of their videos, as well as \"war\", \"Ukraine\", \"Russia\" or \"conflict\"."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "0fabb7f1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>12</td>\n",
       "      <td>39</td>\n",
       "      <td>36651600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>18</td>\n",
       "      <td>738</td>\n",
       "      <td>33906575</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>767</td>\n",
       "      <td>31600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>242</td>\n",
       "      <td>30406300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>authentictimetraveler</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "      <td>112</td>\n",
       "      <td>27760800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>119</th>\n",
       "      <td>wanhedaa</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>141</td>\n",
       "      <td>2042</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>120</th>\n",
       "      <td>karlemmrich</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1376</td>\n",
       "      <td>1688</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>militaryforces.com</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>156</td>\n",
       "      <td>1570</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>ivxxuk</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>143</td>\n",
       "      <td>1206</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>thealetheiaproject</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>15</td>\n",
       "      <td>1092</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>124 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    userName  VerifiedAccount  VidRelated  Totalvid   Streams\n",
       "0         bikini.bottom.news                0          12        39  36651600\n",
       "1                    skynews                1          18       738  33906575\n",
       "2                cheddygrace                0           1       767  31600000\n",
       "3    president.putin.fanpage                0          15       242  30406300\n",
       "4      authentictimetraveler                0           7       112  27760800\n",
       "..                       ...              ...         ...       ...       ...\n",
       "119                 wanhedaa                0           1       141      2042\n",
       "120              karlemmrich                0           1      1376      1688\n",
       "121       militaryforces.com                0           1       156      1570\n",
       "122                   ivxxuk                0           1       143      1206\n",
       "123       thealetheiaproject                0           1        15      1092\n",
       "\n",
       "[124 rows x 5 columns]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#War\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE (u.id =~ '.*news.*' OR\n",
    "      v.desc =~ '.*news.*' OR\n",
    "      v.desc =~ '.*новини.*' OR \n",
    "      v.desc =~ '.*Новости.*') AND \n",
    "      (v.desc =~ '.*war.*' OR\n",
    "      v.desc =~ '.*війни.*' OR\n",
    "      v.desc =~ '.*война.*')\n",
    "RETURN  u.id AS userName, u.verified as VerifiedAccount,count(v) as VidRelated,u.videoCount as Totalvid,sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\"\n",
    "war=pd.DataFrame(graph.run(query).data())\n",
    "war"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "40d44933",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "19"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "war[\"VerifiedAccount\"].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "7dfa0cb5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.1532258064516129"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#proportion of verified accounts\n",
    "19/124"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "08bbec32",
   "metadata": {},
   "outputs": [],
   "source": [
    "users1=war[\"userName\"].to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "a0c98b45",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>megatmurad</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>32</td>\n",
       "      <td>39641600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>14</td>\n",
       "      <td>39</td>\n",
       "      <td>37147500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>738</td>\n",
       "      <td>32625800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>767</td>\n",
       "      <td>31600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>16</td>\n",
       "      <td>242</td>\n",
       "      <td>30492700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>r3dwyn</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>31</td>\n",
       "      <td>1974</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>126</th>\n",
       "      <td>militaryforces.com</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>156</td>\n",
       "      <td>1570</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>127</th>\n",
       "      <td>linkyfirsttiktok</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>114</td>\n",
       "      <td>1214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>128</th>\n",
       "      <td>thealetheiaproject</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>15</td>\n",
       "      <td>1092</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>129</th>\n",
       "      <td>the_ghost_ace_of_kiev</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>257</td>\n",
       "      <td>135</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>130 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    userName  VerifiedAccount  VidRelated  Totalvid   Streams\n",
       "0                 megatmurad                0          15        32  39641600\n",
       "1         bikini.bottom.news                0          14        39  37147500\n",
       "2                    skynews                1           2       738  32625800\n",
       "3                cheddygrace                0           1       767  31600000\n",
       "4    president.putin.fanpage                0          16       242  30492700\n",
       "..                       ...              ...         ...       ...       ...\n",
       "125                   r3dwyn                0           1        31      1974\n",
       "126       militaryforces.com                0           1       156      1570\n",
       "127         linkyfirsttiktok                0           2       114      1214\n",
       "128       thealetheiaproject                0           1        15      1092\n",
       "129    the_ghost_ace_of_kiev                0           1       257       135\n",
       "\n",
       "[130 rows x 5 columns]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Ukraine\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE (u.id =~ '.*news.*' OR\n",
    "      v.desc =~ '.*news.*' OR\n",
    "      v.desc =~ '.*новини.*' OR \n",
    "      v.desc =~ '.*Новости.*') AND \n",
    "      (v.desc =~ '.*ukraine.*' OR\n",
    "      v.desc =~ '.*україни.*'OR\n",
    "      v.desc =~ '.*Украина.*')\n",
    "RETURN  u.id AS userName, u.verified as VerifiedAccount,count(v) as VidRelated,u.videoCount as Totalvid,sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\"\n",
    "ukraine=pd.DataFrame(graph.run(query).data())\n",
    "ukraine"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "dda4e76b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "18"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ukraine[\"VerifiedAccount\"].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "e601c96c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.13846153846153847"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#proportion of verified accounts\n",
    "18/130"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "f75ba58a",
   "metadata": {},
   "outputs": [],
   "source": [
    "users2=ukraine[\"userName\"].to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "6ca8d8d4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>16</td>\n",
       "      <td>242</td>\n",
       "      <td>39692700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>megatmurad</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>32</td>\n",
       "      <td>39641600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>14</td>\n",
       "      <td>39</td>\n",
       "      <td>37147500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>738</td>\n",
       "      <td>32649600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>767</td>\n",
       "      <td>31600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>120</th>\n",
       "      <td>militaryforces.com</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>156</td>\n",
       "      <td>1570</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>linkyfirsttiktok</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>114</td>\n",
       "      <td>1214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>thealetheiaproject</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>15</td>\n",
       "      <td>1092</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>ykrainews</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>16</td>\n",
       "      <td>408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>crazyniiiik</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>32</td>\n",
       "      <td>163</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>125 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    userName  VerifiedAccount  VidRelated  Totalvid   Streams\n",
       "0    president.putin.fanpage                0          16       242  39692700\n",
       "1                 megatmurad                0          15        32  39641600\n",
       "2         bikini.bottom.news                0          14        39  37147500\n",
       "3                    skynews                1           3       738  32649600\n",
       "4                cheddygrace                0           1       767  31600000\n",
       "..                       ...              ...         ...       ...       ...\n",
       "120       militaryforces.com                0           1       156      1570\n",
       "121         linkyfirsttiktok                0           2       114      1214\n",
       "122       thealetheiaproject                0           1        15      1092\n",
       "123                ykrainews                0           1        16       408\n",
       "124              crazyniiiik                0           1        32       163\n",
       "\n",
       "[125 rows x 5 columns]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Russia\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE (u.id =~ '.*news.*' OR\n",
    "      v.desc =~ '.*news.*' OR\n",
    "      v.desc =~ '.*новини.*'  OR \n",
    "      v.desc =~ '.*Новости.*') AND \n",
    "      (v.desc =~ '.*russia.*' OR\n",
    "      v.desc =~ '.*Росія.*' OR\n",
    "      v.desc =~ '.*Россия.*')\n",
    "RETURN  u.id AS userName, u.verified as VerifiedAccount,count(v) as VidRelated,u.videoCount as Totalvid,sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\"\n",
    "russia=pd.DataFrame(graph.run(query).data())\n",
    "russia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "058190d3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "18"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "russia[\"VerifiedAccount\"].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "802922fe",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.144"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#proportion of verified accounts\n",
    "18/125"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "22d7db81",
   "metadata": {},
   "outputs": [],
   "source": [
    "users3=russia[\"userName\"].to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "738197d9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>caspolnews</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>404</td>\n",
       "      <td>9341700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>therealisticfishhead</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>90</td>\n",
       "      <td>5300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>themsinstem</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>339</td>\n",
       "      <td>5105004</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>latestconflictwarnews2</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "      <td>98</td>\n",
       "      <td>1338500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>lordeedge</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>1348</td>\n",
       "      <td>993200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>fundiambb1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>481</td>\n",
       "      <td>706700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>thegossipnewstribune</td>\n",
       "      <td>0</td>\n",
       "      <td>27</td>\n",
       "      <td>32</td>\n",
       "      <td>532612</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world_news_clips</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>26</td>\n",
       "      <td>347287</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>project_bandito</td>\n",
       "      <td>0</td>\n",
       "      <td>27</td>\n",
       "      <td>44</td>\n",
       "      <td>323462</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>wearescotland</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>740</td>\n",
       "      <td>306500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>howya.now</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "      <td>121</td>\n",
       "      <td>268389</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>sardar.rehan</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1456</td>\n",
       "      <td>264400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>thedailyrundown</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "      <td>113</td>\n",
       "      <td>259790</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>thenewsmovement</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>185</td>\n",
       "      <td>258900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>military_newss</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>250009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>738</td>\n",
       "      <td>225800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ca_astronorthstarph</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>796</td>\n",
       "      <td>202200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>tiktok__czech</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>8</td>\n",
       "      <td>186300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>3706</td>\n",
       "      <td>134900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>69</td>\n",
       "      <td>123600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>seoulsecrets</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>351</td>\n",
       "      <td>106400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>supercad55</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>47</td>\n",
       "      <td>69551</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>countdaedalus</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>130</td>\n",
       "      <td>47900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>dailyrundownwithchris</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1008</td>\n",
       "      <td>34300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>cazacaza23</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>105</td>\n",
       "      <td>29936</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>forcesnews</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>23</td>\n",
       "      <td>25304</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>crazyniiiik</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>32</td>\n",
       "      <td>19251</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>relevanttopics</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>390</td>\n",
       "      <td>13793</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>cnn</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>210</td>\n",
       "      <td>12100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>robertjackcutter</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>391</td>\n",
       "      <td>9295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>theverymessyworld</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>215</td>\n",
       "      <td>789</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  userName  VerifiedAccount  VidRelated  Totalvid  Streams\n",
       "0               caspolnews                0           3       404  9341700\n",
       "1     therealisticfishhead                0           1        90  5300000\n",
       "2              themsinstem                0          15       339  5105004\n",
       "3   latestconflictwarnews2                0           5        98  1338500\n",
       "4                lordeedge                0           2      1348   993200\n",
       "5               fundiambb1                0           1       481   706700\n",
       "6     thegossipnewstribune                0          27        32   532612\n",
       "7         world_news_clips                0           2        26   347287\n",
       "8          project_bandito                0          27        44   323462\n",
       "9            wearescotland                0           1       740   306500\n",
       "10               howya.now                0           8       121   268389\n",
       "11            sardar.rehan                0           1      1456   264400\n",
       "12         thedailyrundown                0           8       113   259790\n",
       "13         thenewsmovement                1           1       185   258900\n",
       "14          military_newss                0           4         5   250009\n",
       "15                 skynews                1           1       738   225800\n",
       "16     ca_astronorthstarph                0           1       796   202200\n",
       "17           tiktok__czech                0           1         8   186300\n",
       "18                 cbsnews                1           1      3706   134900\n",
       "19          city__resident                0           2        69   123600\n",
       "20            seoulsecrets                0           1       351   106400\n",
       "21              supercad55                0           4        47    69551\n",
       "22           countdaedalus                0           1       130    47900\n",
       "23   dailyrundownwithchris                0           1      1008    34300\n",
       "24              cazacaza23                0           4       105    29936\n",
       "25              forcesnews                0           3        23    25304\n",
       "26             crazyniiiik                0           4        32    19251\n",
       "27          relevanttopics                0           3       390    13793\n",
       "28                     cnn                1           1       210    12100\n",
       "29        robertjackcutter                0           1       391     9295\n",
       "30       theverymessyworld                0           1       215      789"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Conflict\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE (u.id =~ '.*new.*' OR\n",
    "      v.desc =~ '.*news.*' OR\n",
    "      v.desc =~ '.*новини.*'  OR \n",
    "      v.desc =~ '.*Новости.*') AND \n",
    "      (v.desc =~ '.*conflict.*' OR\n",
    "      v.desc =~ '.*конфлікт.*' OR\n",
    "      v.desc =~ '.*конфликт.*')\n",
    "RETURN  u.id AS userName, u.verified as VerifiedAccount,count(v) as VidRelated,u.videoCount as Totalvid,sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\"\n",
    "conflict=pd.DataFrame(graph.run(query).data())\n",
    "conflict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "595c1a85",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conflict[\"VerifiedAccount\"].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "a407ea4b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.12903225806451613"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#proportion of verified accounts\n",
    "4/31"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b83ffb8c",
   "metadata": {},
   "source": [
    "It seems that the word conflict is the least used of all, since it reduces the number of creators by a quarter. Therefore, we will study its behavior independently.\n",
    "\n",
    "On the other hand, we can verify how the traditional media, which are verified on all platforms, either do not consider tiktok as an important platform to create content, or are advanced by unofficial accounts that are more popular among users, since the verified ones they do not exceed 15% in any of the above groups.\n",
    "\n",
    "Now we will select the 20 profiles that create the most popular content with respect to these filters"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "f5cbdab2",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Intersection of the different list of creators (that mention war, ukraine & russia in any video)\n",
    "users=list(set(users1) & set(users2)& set(users3))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "183a7f18",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "99"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(users)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "33f57244",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>48940200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>1</td>\n",
       "      <td>41258500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>37147500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>34132375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>31600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>xenasolo</td>\n",
       "      <td>0</td>\n",
       "      <td>30629200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>24747400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world247breakingnews</td>\n",
       "      <td>0</td>\n",
       "      <td>24664271</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>abc15arizona</td>\n",
       "      <td>1</td>\n",
       "      <td>23950384</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>matthewcassel</td>\n",
       "      <td>0</td>\n",
       "      <td>23114400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>aaronparnas6</td>\n",
       "      <td>0</td>\n",
       "      <td>20800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>planefinder</td>\n",
       "      <td>1</td>\n",
       "      <td>19829600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>mihhail83</td>\n",
       "      <td>0</td>\n",
       "      <td>17416100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>military_thingz</td>\n",
       "      <td>0</td>\n",
       "      <td>16800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>visegrad24</td>\n",
       "      <td>0</td>\n",
       "      <td>16694300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>random.content99</td>\n",
       "      <td>0</td>\n",
       "      <td>15100801</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>politicsoftheworld</td>\n",
       "      <td>0</td>\n",
       "      <td>14466600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>aviationhxb</td>\n",
       "      <td>0</td>\n",
       "      <td>13926300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsmornings</td>\n",
       "      <td>1</td>\n",
       "      <td>12221719</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>11974702</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   userName  VerifiedAccount   Streams\n",
       "0   president.putin.fanpage                0  48940200\n",
       "1             viceworldnews                1  41258500\n",
       "2        bikini.bottom.news                0  37147500\n",
       "3                   skynews                1  34132375\n",
       "4               cheddygrace                0  31600000\n",
       "5                  xenasolo                0  30629200\n",
       "6                   cbsnews                1  24747400\n",
       "7      world247breakingnews                0  24664271\n",
       "8              abc15arizona                1  23950384\n",
       "9             matthewcassel                0  23114400\n",
       "10             aaronparnas6                0  20800000\n",
       "11              planefinder                1  19829600\n",
       "12                mihhail83                0  17416100\n",
       "13          military_thingz                0  16800000\n",
       "14               visegrad24                0  16694300\n",
       "15         random.content99                0  15100801\n",
       "16       politicsoftheworld                0  14466600\n",
       "17              aviationhxb                0  13926300\n",
       "18              cbsmornings                1  12221719\n",
       "19           city__resident                0  11974702"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#First we will sort the list of the users by streaming again and we will select the main 20\n",
    "query=  \"\"\"\n",
    "WITH ['president.putin.fanpage','frankdomenic','random.content99','bbcnewsukrainian','ykrainews','joy_enjoy6','themsinstem',\n",
    "'project_bandito','ervesto77','about_ww3','tiktok__czech','picklenews','visegrad24','newswoow','abc15arizona','dogedave',\n",
    " 'tip_berlin','ukrainerussianewsdaily','papakreem','militaryforces.com','dark_engine84','whitecheddarbread','caspolnews',\n",
    " 'tv13news','world_news_clips','cbsmornings','crease19','lordeedge','dailyrundownwithchris','theverymessyworld','fundiambb1',\n",
    " 'viceworldnews','aaronparnas6','internationalnews12365','bigmike3223','cheddygrace','cbsnews','matthewcassel','seoulsecrets',\n",
    " 'world247breakingnews','an4e216','latestconflictwarnews2','military_thingz','goodmorningbadnews','supercad55','robertjackcutter',\n",
    " 'aviationhxb','morriganamber','thenewsmovement','belgian_warrior_group','relevanttopics','stand.with.ukraine.now','iam.rob21',\n",
    " 'david.heath','military_newss','dailymail','xenasolo','gregmustreader','eurovision.by.kseniia','ca_astronorthstarph',\n",
    " 'crazyniiiik','planefinder','thealetheiaproject','ukraine.news.today','the_ghost_ace_of_kiev','forcesnews',\n",
    " 'newz2you','bbcnews','s1xrey','.military.newss','highlightsideline','skynews','therealisticfishhead','_rachtok_','city__resident',\n",
    " 'u24_news','thegossipnewstribune','cnn','sashareheylo','howya.now','politicsoftheworld','snoopy.vn','frankorando','mihhail83',\n",
    " 'thefirstnews','healingwithirina','themiracle35','thehistorylegends','astridszarek','countdaedalus','ukraine_latest','thedailyrundown',\n",
    " 'christina_hrystya','bikini.bottom.news','ukraine_war_1','bigkingpiz','zeitimbild','1newsnz','cazacaza23'] as users\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id in users and\n",
    "          (v.desc =~ '.*ukraine.*' OR\n",
    "          v.desc =~ '.*war.*' OR \n",
    "          v.desc =~ '.*russia.*')\n",
    "RETURN   u.id AS userName, u.verified as VerifiedAccount , sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\" \n",
    "sortedusers=pd.DataFrame(graph.run(query).data()).head(20)\n",
    "sortedusers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "a6f7b985",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "6"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sortedusers[\"VerifiedAccount\"].sum()\n",
    "#We can see how the verified accounts are less than the 50% of the most consumed accounts "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "f62606da",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['president.putin.fanpage',\n",
       " 'viceworldnews',\n",
       " 'bikini.bottom.news',\n",
       " 'skynews',\n",
       " 'cheddygrace',\n",
       " 'xenasolo',\n",
       " 'cbsnews',\n",
       " 'world247breakingnews',\n",
       " 'abc15arizona',\n",
       " 'matthewcassel',\n",
       " 'aaronparnas6',\n",
       " 'planefinder',\n",
       " 'mihhail83',\n",
       " 'military_thingz',\n",
       " 'visegrad24',\n",
       " 'random.content99',\n",
       " 'politicsoftheworld',\n",
       " 'aviationhxb',\n",
       " 'cbsmornings',\n",
       " 'city__resident']"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sortedusers[\"userName\"].to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "4cd03543",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Scoring each account by the descriptions of their videos related to the war, ukraine and russia\n",
    "sai = SentimentIntensityAnalyzer()\n",
    "news=sortedusers[\"userName\"]\n",
    "for index, new in enumerate(news):\n",
    "    score=[]\n",
    "    query = \"\"\"\n",
    "    MATCH (u:user)-[a:author]->(v:video)\n",
    "    WHERE u.id =~ '%s' and\n",
    "          (v.desc =~ '.*ukraine.*' OR\n",
    "          v.desc =~ '.*war.*' OR \n",
    "          v.desc =~ '.*russia.*')\n",
    "    RETURN v.desc AS description; \n",
    "    \"\"\" % new\n",
    "    # the % new inserts value of new where the %s is in the WHERE statement\n",
    "    result=pd.DataFrame(graph.run(query).data())\n",
    "    if (len(result)!=0):\n",
    "        for sentence in result['description']:\n",
    "            lang = detect(sentence)\n",
    "            if lang=='en':\n",
    "                kvp = sai.polarity_scores(sentence)\n",
    "                score.append(kvp['compound'])\n",
    "        #print(new,'has mean sentiment score of', round(np.mean(score),3),'from', len(score),'videos')\n",
    "        #print()\n",
    "        sortedusers.at[index, \"Score\"]=round(np.mean(score),3)\n",
    "        \n",
    "    else:\n",
    "        print(new,'returned no results in video description')\n",
    "        print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "d2a825e8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Streams</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>48940200</td>\n",
       "      <td>0.114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>1</td>\n",
       "      <td>41258500</td>\n",
       "      <td>-0.263</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>37147500</td>\n",
       "      <td>-0.053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>34132375</td>\n",
       "      <td>-0.173</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>31600000</td>\n",
       "      <td>-0.511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>xenasolo</td>\n",
       "      <td>0</td>\n",
       "      <td>30629200</td>\n",
       "      <td>0.097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>24747400</td>\n",
       "      <td>-0.254</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world247breakingnews</td>\n",
       "      <td>0</td>\n",
       "      <td>24664271</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>abc15arizona</td>\n",
       "      <td>1</td>\n",
       "      <td>23950384</td>\n",
       "      <td>0.045</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>matthewcassel</td>\n",
       "      <td>0</td>\n",
       "      <td>23114400</td>\n",
       "      <td>-0.331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>aaronparnas6</td>\n",
       "      <td>0</td>\n",
       "      <td>20800000</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>planefinder</td>\n",
       "      <td>1</td>\n",
       "      <td>19829600</td>\n",
       "      <td>-0.214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>mihhail83</td>\n",
       "      <td>0</td>\n",
       "      <td>17416100</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>military_thingz</td>\n",
       "      <td>0</td>\n",
       "      <td>16800000</td>\n",
       "      <td>-0.100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>visegrad24</td>\n",
       "      <td>0</td>\n",
       "      <td>16694300</td>\n",
       "      <td>0.053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>random.content99</td>\n",
       "      <td>0</td>\n",
       "      <td>15100801</td>\n",
       "      <td>0.122</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>politicsoftheworld</td>\n",
       "      <td>0</td>\n",
       "      <td>14466600</td>\n",
       "      <td>0.050</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>aviationhxb</td>\n",
       "      <td>0</td>\n",
       "      <td>13926300</td>\n",
       "      <td>-0.049</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsmornings</td>\n",
       "      <td>1</td>\n",
       "      <td>12221719</td>\n",
       "      <td>-0.198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>11974702</td>\n",
       "      <td>-0.025</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   userName  VerifiedAccount   Streams  Score\n",
       "0   president.putin.fanpage                0  48940200  0.114\n",
       "1             viceworldnews                1  41258500 -0.263\n",
       "2        bikini.bottom.news                0  37147500 -0.053\n",
       "3                   skynews                1  34132375 -0.173\n",
       "4               cheddygrace                0  31600000 -0.511\n",
       "5                  xenasolo                0  30629200  0.097\n",
       "6                   cbsnews                1  24747400 -0.254\n",
       "7      world247breakingnews                0  24664271  0.000\n",
       "8              abc15arizona                1  23950384  0.045\n",
       "9             matthewcassel                0  23114400 -0.331\n",
       "10             aaronparnas6                0  20800000  0.000\n",
       "11              planefinder                1  19829600 -0.214\n",
       "12                mihhail83                0  17416100  0.000\n",
       "13          military_thingz                0  16800000 -0.100\n",
       "14               visegrad24                0  16694300  0.053\n",
       "15         random.content99                0  15100801  0.122\n",
       "16       politicsoftheworld                0  14466600  0.050\n",
       "17              aviationhxb                0  13926300 -0.049\n",
       "18              cbsmornings                1  12221719 -0.198\n",
       "19           city__resident                0  11974702 -0.025"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sortedusers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "66425d43",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Streams</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>1</td>\n",
       "      <td>41258500</td>\n",
       "      <td>-0.263</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>34132375</td>\n",
       "      <td>-0.173</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>24747400</td>\n",
       "      <td>-0.254</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>abc15arizona</td>\n",
       "      <td>1</td>\n",
       "      <td>23950384</td>\n",
       "      <td>0.045</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>planefinder</td>\n",
       "      <td>1</td>\n",
       "      <td>19829600</td>\n",
       "      <td>-0.214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsmornings</td>\n",
       "      <td>1</td>\n",
       "      <td>12221719</td>\n",
       "      <td>-0.198</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         userName  VerifiedAccount   Streams  Score\n",
       "1   viceworldnews                1  41258500 -0.263\n",
       "3         skynews                1  34132375 -0.173\n",
       "6         cbsnews                1  24747400 -0.254\n",
       "8    abc15arizona                1  23950384  0.045\n",
       "11    planefinder                1  19829600 -0.214\n",
       "18    cbsmornings                1  12221719 -0.198"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "VerifiedAccounts=sortedusers.loc[sortedusers['VerifiedAccount'] == 1]\n",
    "VerifiedAccounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "bb5d0076",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-0.17616666666666667"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "VerifiedAccounts[\"Score\"].mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "ec4d6900",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.045"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "VerifiedAccounts[\"Score\"].max()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "e7ceab83",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Streams</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>48940200</td>\n",
       "      <td>0.114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>37147500</td>\n",
       "      <td>-0.053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>31600000</td>\n",
       "      <td>-0.511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>xenasolo</td>\n",
       "      <td>0</td>\n",
       "      <td>30629200</td>\n",
       "      <td>0.097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world247breakingnews</td>\n",
       "      <td>0</td>\n",
       "      <td>24664271</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>matthewcassel</td>\n",
       "      <td>0</td>\n",
       "      <td>23114400</td>\n",
       "      <td>-0.331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>aaronparnas6</td>\n",
       "      <td>0</td>\n",
       "      <td>20800000</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>mihhail83</td>\n",
       "      <td>0</td>\n",
       "      <td>17416100</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>military_thingz</td>\n",
       "      <td>0</td>\n",
       "      <td>16800000</td>\n",
       "      <td>-0.100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>visegrad24</td>\n",
       "      <td>0</td>\n",
       "      <td>16694300</td>\n",
       "      <td>0.053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>random.content99</td>\n",
       "      <td>0</td>\n",
       "      <td>15100801</td>\n",
       "      <td>0.122</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>politicsoftheworld</td>\n",
       "      <td>0</td>\n",
       "      <td>14466600</td>\n",
       "      <td>0.050</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>aviationhxb</td>\n",
       "      <td>0</td>\n",
       "      <td>13926300</td>\n",
       "      <td>-0.049</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>11974702</td>\n",
       "      <td>-0.025</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   userName  VerifiedAccount   Streams  Score\n",
       "0   president.putin.fanpage                0  48940200  0.114\n",
       "2        bikini.bottom.news                0  37147500 -0.053\n",
       "4               cheddygrace                0  31600000 -0.511\n",
       "5                  xenasolo                0  30629200  0.097\n",
       "7      world247breakingnews                0  24664271  0.000\n",
       "9             matthewcassel                0  23114400 -0.331\n",
       "10             aaronparnas6                0  20800000  0.000\n",
       "12                mihhail83                0  17416100  0.000\n",
       "13          military_thingz                0  16800000 -0.100\n",
       "14               visegrad24                0  16694300  0.053\n",
       "15         random.content99                0  15100801  0.122\n",
       "16       politicsoftheworld                0  14466600  0.050\n",
       "17              aviationhxb                0  13926300 -0.049\n",
       "19           city__resident                0  11974702 -0.025"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "NoVerifiedAccounts=sortedusers.loc[sortedusers['VerifiedAccount'] == 0]\n",
    "NoVerifiedAccounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "da74b255",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-0.045214285714285714"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "NoVerifiedAccounts[\"Score\"].mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "c58bbcb6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.122"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "NoVerifiedAccounts[\"Score\"].max()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f4ae212e",
   "metadata": {},
   "source": [
    "Let's try now how it works under the \"conflict\" accounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "17c0ec9f",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\fromnumeric.py:3474: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\_methods.py:189: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\fromnumeric.py:3474: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\_methods.py:189: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\fromnumeric.py:3474: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\_methods.py:189: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n"
     ]
    }
   ],
   "source": [
    "#Scoring each account by the descriptions of their videos related to the war, ukraine and russia\n",
    "sai = SentimentIntensityAnalyzer()\n",
    "news=conflict[\"userName\"]\n",
    "for index, new in enumerate(news):\n",
    "    score=[]\n",
    "    query = \"\"\"\n",
    "    MATCH (u:user)-[a:author]->(v:video)\n",
    "    WHERE u.id =~ '%s' and\n",
    "          (v.desc =~ '.*conflict.*' OR\n",
    "      v.desc =~ '.*конфлікт.*' OR\n",
    "      v.desc =~ '.*конфликт.*')\n",
    "    RETURN v.desc AS description; \n",
    "    \"\"\" % new\n",
    "    # the % new inserts value of new where the %s is in the WHERE statement\n",
    "    result=pd.DataFrame(graph.run(query).data())\n",
    "    if (len(result)!=0):\n",
    "        for sentence in result['description']:\n",
    "            lang = detect(sentence)\n",
    "            if lang=='en':\n",
    "                kvp = sai.polarity_scores(sentence)\n",
    "                score.append(kvp['compound'])\n",
    "        #print(new,'has mean sentiment score of', round(np.mean(score),3),'from', len(score),'videos')\n",
    "        #print()\n",
    "        conflict.at[index, \"Score\"]=round(np.mean(score),3)\n",
    "        \n",
    "    else:\n",
    "        print(new,'returned no results in video description')\n",
    "        print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "4b17aca7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>caspolnews</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>404</td>\n",
       "      <td>9341700</td>\n",
       "      <td>-0.127</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>therealisticfishhead</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>90</td>\n",
       "      <td>5300000</td>\n",
       "      <td>-0.318</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>themsinstem</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>339</td>\n",
       "      <td>5105004</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>latestconflictwarnews2</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "      <td>98</td>\n",
       "      <td>1338500</td>\n",
       "      <td>-0.260</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>lordeedge</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>1348</td>\n",
       "      <td>993200</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>fundiambb1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>481</td>\n",
       "      <td>706700</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>thegossipnewstribune</td>\n",
       "      <td>0</td>\n",
       "      <td>27</td>\n",
       "      <td>32</td>\n",
       "      <td>532612</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world_news_clips</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>26</td>\n",
       "      <td>347287</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>project_bandito</td>\n",
       "      <td>0</td>\n",
       "      <td>27</td>\n",
       "      <td>44</td>\n",
       "      <td>323462</td>\n",
       "      <td>-0.017</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>wearescotland</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>740</td>\n",
       "      <td>306500</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>howya.now</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "      <td>121</td>\n",
       "      <td>268389</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>sardar.rehan</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1456</td>\n",
       "      <td>264400</td>\n",
       "      <td>-0.511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>thedailyrundown</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "      <td>113</td>\n",
       "      <td>259790</td>\n",
       "      <td>-0.045</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>thenewsmovement</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>185</td>\n",
       "      <td>258900</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>military_newss</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>250009</td>\n",
       "      <td>-0.201</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>738</td>\n",
       "      <td>225800</td>\n",
       "      <td>-0.361</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ca_astronorthstarph</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>796</td>\n",
       "      <td>202200</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>tiktok__czech</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>8</td>\n",
       "      <td>186300</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>3706</td>\n",
       "      <td>134900</td>\n",
       "      <td>0.459</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>69</td>\n",
       "      <td>123600</td>\n",
       "      <td>0.117</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>seoulsecrets</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>351</td>\n",
       "      <td>106400</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>supercad55</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>47</td>\n",
       "      <td>69551</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>countdaedalus</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>130</td>\n",
       "      <td>47900</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>dailyrundownwithchris</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1008</td>\n",
       "      <td>34300</td>\n",
       "      <td>-0.382</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>cazacaza23</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>105</td>\n",
       "      <td>29936</td>\n",
       "      <td>-0.055</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>forcesnews</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>23</td>\n",
       "      <td>25304</td>\n",
       "      <td>-0.005</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>crazyniiiik</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>32</td>\n",
       "      <td>19251</td>\n",
       "      <td>-0.034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>relevanttopics</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>390</td>\n",
       "      <td>13793</td>\n",
       "      <td>-0.309</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>cnn</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>210</td>\n",
       "      <td>12100</td>\n",
       "      <td>-0.913</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>robertjackcutter</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>391</td>\n",
       "      <td>9295</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>theverymessyworld</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>215</td>\n",
       "      <td>789</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  userName  VerifiedAccount  VidRelated  Totalvid  Streams  \\\n",
       "0               caspolnews                0           3       404  9341700   \n",
       "1     therealisticfishhead                0           1        90  5300000   \n",
       "2              themsinstem                0          15       339  5105004   \n",
       "3   latestconflictwarnews2                0           5        98  1338500   \n",
       "4                lordeedge                0           2      1348   993200   \n",
       "5               fundiambb1                0           1       481   706700   \n",
       "6     thegossipnewstribune                0          27        32   532612   \n",
       "7         world_news_clips                0           2        26   347287   \n",
       "8          project_bandito                0          27        44   323462   \n",
       "9            wearescotland                0           1       740   306500   \n",
       "10               howya.now                0           8       121   268389   \n",
       "11            sardar.rehan                0           1      1456   264400   \n",
       "12         thedailyrundown                0           8       113   259790   \n",
       "13         thenewsmovement                1           1       185   258900   \n",
       "14          military_newss                0           4         5   250009   \n",
       "15                 skynews                1           1       738   225800   \n",
       "16     ca_astronorthstarph                0           1       796   202200   \n",
       "17           tiktok__czech                0           1         8   186300   \n",
       "18                 cbsnews                1           1      3706   134900   \n",
       "19          city__resident                0           2        69   123600   \n",
       "20            seoulsecrets                0           1       351   106400   \n",
       "21              supercad55                0           4        47    69551   \n",
       "22           countdaedalus                0           1       130    47900   \n",
       "23   dailyrundownwithchris                0           1      1008    34300   \n",
       "24              cazacaza23                0           4       105    29936   \n",
       "25              forcesnews                0           3        23    25304   \n",
       "26             crazyniiiik                0           4        32    19251   \n",
       "27          relevanttopics                0           3       390    13793   \n",
       "28                     cnn                1           1       210    12100   \n",
       "29        robertjackcutter                0           1       391     9295   \n",
       "30       theverymessyworld                0           1       215      789   \n",
       "\n",
       "    Score  \n",
       "0  -0.127  \n",
       "1  -0.318  \n",
       "2   0.000  \n",
       "3  -0.260  \n",
       "4   0.000  \n",
       "5   0.000  \n",
       "6   0.000  \n",
       "7   0.000  \n",
       "8  -0.017  \n",
       "9   0.000  \n",
       "10  0.000  \n",
       "11 -0.511  \n",
       "12 -0.045  \n",
       "13    NaN  \n",
       "14 -0.201  \n",
       "15 -0.361  \n",
       "16  0.000  \n",
       "17  0.000  \n",
       "18  0.459  \n",
       "19  0.117  \n",
       "20    NaN  \n",
       "21  0.000  \n",
       "22  0.000  \n",
       "23 -0.382  \n",
       "24 -0.055  \n",
       "25 -0.005  \n",
       "26 -0.034  \n",
       "27 -0.309  \n",
       "28 -0.913  \n",
       "29    NaN  \n",
       "30  0.000  "
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conflict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "094bf292",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-0.27166666666666667"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "VerifiedConflict=conflict.loc[conflict['VerifiedAccount'] == 1]\n",
    "VerifiedConflict[\"Score\"].mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "9817b0e8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-0.08588000000000001"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "NoVerifiedConflict=conflict.loc[conflict['VerifiedAccount'] == 0]\n",
    "NoVerifiedConflict[\"Score\"].mean()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ff496b05",
   "metadata": {},
   "source": [
    "Confirming what has already been said, the analysis shows how the verified accounts condemn the \"conflict\" with a more negative language, while the unverified ones obtain a more neutral balance, usually as a result of the presence of both positive and negative values."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0e05f8ab",
   "metadata": {},
   "source": [
    "Although the predominant language is English, we can now study the most mentioned topics according to the language used in said descriptions, in order to see the trend that each language presents."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "bae69a2d",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "WITH ['president.putin.fanpage','viceworldnews','bikini.bottom.news','skynews','cheddygrace','xenasolo','cbsnews','world247breakingnews','abc15arizona','matthewcassel','aaronparnas6','planefinder','mihhail83','military_thingz','visegrad24','random.content99','politicsoftheworld','aviationhxb','cbsmornings','city__resident'] as users\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE (u.id in users) AND \n",
    "      (v.desc =~ '.*news.*' OR\n",
    "      v.desc =~ '.*новини.*' OR \n",
    "      v.desc =~ '.*Новости.*'OR\n",
    "      v.desc =~ '.*ukraine.*' OR\n",
    "      v.desc =~ '.*україни.*' OR\n",
    "      v.desc =~ '.*Украина.*'OR\n",
    "      v.desc =~ '.*russia.*' OR\n",
    "      v.desc =~ '.*Росія.*' OR\n",
    "      v.desc =~ '.*Россия.*' OR\n",
    "      v.desc =~ '.*war.*' OR\n",
    "      v.desc =~ '.*війни.*' OR\n",
    "       v.desc =~ '.*война.*' )\n",
    "RETURN u.id AS username,\n",
    "       u.verified AS verified,\n",
    "       sum(v.playCount) AS playCount,\n",
    "       v.desc AS description\n",
    "ORDER BY playCount DESC\n",
    "\"\"\"\n",
    "result = pd.DataFrame(graph.run(query).data())\n",
    "result.head()\n",
    "uk=[]\n",
    "en=[]\n",
    "other=[]\n",
    "for sentence in result['description']:\n",
    "    lang = detect(sentence)\n",
    "    if lang=='uk':\n",
    "        uk.append(sentence)\n",
    "    elif lang=='en':\n",
    "        en.append(sentence)\n",
    "    else:\n",
    "        other.append(sentence)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "6cd41395",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      " en\n",
      "[('russia', 239), ('war', 133), ('fyp', 120), ('putin', 94), ('ukraine🇺🇦', 81), ('ukrainewar', 77), ('russian', 64), ('invasion', 41), ('fypシ', 35), ('politics', 32), ('abc15arizona', 30), ('kyiv', 30), ('abc15', 28), ('nato', 27), ('biden', 25), ('bikinibottomnews', 25), ('zelenskyy', 25), ('abc15news', 24), ('foryou', 24), ('says', 23)]\n",
      "\n",
      " uk\n",
      "[('новинах', 1), ('чули', 1), ('росіяни', 1), ('вигадуйте', 1), ('українськийтікток', 1), ('війна', 1), ('війнавукраїні', 1), ('війна2022', 1), ('війназросією', 1)]\n",
      "\n",
      " other\n",
      "[('russia', 34), ('putin', 24), ('ukrainewar', 20), ('fyp', 15), ('vladimirputin', 13), ('ukraine🇺🇦', 11), ('україна🇺🇦', 8), ('war', 7), ('poland', 7), ('zelensky', 7), ('army', 6), ('украина', 6), ('stopwar', 5), ('ukrainewarrussia', 5), ('2022', 4), ('🇺🇦', 4), ('polska', 4), ('dlaciebie', 4), ('украинавойна', 4), ('nowar', 3)]\n"
     ]
    }
   ],
   "source": [
    "\n",
    "morestops = ['ukraine','ukraina','україна','українські','ukrainian','#','!','?',\n",
    "             '&','>','<','@','.',',','у','в','«','»','на','до','про','що','як', 'з','а','коли',\n",
    "            'news', 'це', 'новини', 'зсу','ми','його','не','чи',':','за','було','’','і']\n",
    "stops = set(stopwords.words('english'))\n",
    "def wordc(sentences, lang):\n",
    "    print('\\n',lang)\n",
    "    wordlist = [] # put all words into one list\n",
    "    for sentence in sentences:\n",
    "        wordlist.append(sentence)\n",
    "    wc = WordCloud(background_color = 'white', width = 1920, height = 1080, max_words=20)\n",
    "    text=(\" \").join(wordlist)\n",
    "    tokens = word_tokenize(text)\n",
    "    tokens = [word.lower() for word in tokens]\n",
    "    tokens = [word for word in tokens if word not in morestops]\n",
    "    tokens = [word for word in tokens if word not in stopwords.words('english') ]\n",
    "    text = ' '.join(tokens)\n",
    "    #print(text)\n",
    "    wc.generate_from_text(text)\n",
    "    wc.to_file('wordcloud_'+lang+'.png')\n",
    "    fdist = FreqDist(tokens)\n",
    "    top30 = fdist.most_common(20)\n",
    "    print(top30)\n",
    "\n",
    "\n",
    "wordc(en, 'en')\n",
    "wordc(uk, 'uk')\n",
    "wordc(other, 'other')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "75822a31",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[('fi', 12), ('et', 10), ('en', 9), ('pl', 7), ('id', 5), ('no', 3), ('af', 2), ('ru', 1), ('tl', 1), ('sk', 1)]\n"
     ]
    }
   ],
   "source": [
    "langs = []\n",
    "for i in other:\n",
    "    langs.append(detect(i))\n",
    "fdist = FreqDist(langs)\n",
    "print(fdist.most_common(10))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "165d825f",
   "metadata": {},
   "source": [
    "Translation of the ucranian words:  \n",
    "news-heard-Russians-invent-Ukrainian tiktok-war-war in Ukraine-war2022-war with Russia\n",
    "\n",
    "We can see how practically all the accounts in which the word \"news\" is mentioned are English-speaking, since the frequency of words in other languages is practically zero. In the case of the \"others\" category, it is mainly made up of hashtags or a combinations of words that the algorithm does not detect as one language or another.\n",
    "\n",
    "Finally, and focusing more on the visual aspect of the database, we are going to study the recommendations that TikTok makes of users. Having already selected the users with the most popular videos on the subject, we are going to study the network of recommendations generated by the algorithm and check if there is any pattern."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "96754145",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Graph of the recommendations\n",
    "query = \"\"\"\n",
    "WITH ['president.putin.fanpage','viceworldnews','bikini.bottom.news','skynews','cheddygrace','xenasolo','cbsnews','world247breakingnews','abc15arizona','matthewcassel','aaronparnas6','planefinder','mihhail83','military_thingz','visegrad24','random.content99','politicsoftheworld','aviationhxb','cbsmornings','city__resident'] as users\n",
    " MATCH (u:user)-[r:recommends]->(a:user)\n",
    " WHERE u.id in users\n",
    " RETURN *\n",
    "\"\"\"\n",
    "graph.run(query);\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "f48b6ab5",
   "metadata": {},
   "outputs": [],
   "source": [
    "#List of the names of the recommended accounts\n",
    "query = \"\"\"\n",
    "WITH ['president.putin.fanpage','viceworldnews','bikini.bottom.news','skynews','cheddygrace','xenasolo','cbsnews','world247breakingnews','abc15arizona','matthewcassel','aaronparnas6','planefinder','mihhail83','military_thingz','visegrad24','random.content99','politicsoftheworld','aviationhxb','cbsmornings','city__resident'] as users\n",
    " MATCH (u:user)-[r:recommends]->(a:user)\n",
    " WHERE u.id in users \n",
    "RETURN DISTINCT a.id\n",
    "\"\"\"\n",
    "graph.run(query);\n",
    "\n",
    "#There are 516"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "cb75969b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>RecommendedAccount</th>\n",
       "      <th>recommendCnt</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>c4news</td>\n",
       "      <td>5</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>skynews</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>thealetheiaproject</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>internationalnews12365</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>24news4u</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>forcesnews</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>latestnewsss</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>istandwithukraine39</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>underthedesknews</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>typical_democrat</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>donjomain</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>yahoonews</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>quicktakenews</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>maxfostercnn</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>typical_democrat2</td>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>thefirstnews</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>cbsmornings</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>therecount</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>itsrachelscott</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>danielmichno</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        RecommendedAccount  recommendCnt  VerifiedAccount\n",
       "0                   c4news             5                1\n",
       "1                  skynews             3                1\n",
       "2       thealetheiaproject             3                0\n",
       "3   internationalnews12365             3                0\n",
       "4                 24news4u             3                0\n",
       "5               forcesnews             3                0\n",
       "6             latestnewsss             3                0\n",
       "7      istandwithukraine39             3                0\n",
       "8         underthedesknews             3                1\n",
       "9         typical_democrat             3                0\n",
       "10               donjomain             3                0\n",
       "11               yahoonews             3                1\n",
       "12           quicktakenews             3                1\n",
       "13            maxfostercnn             3                1\n",
       "14       typical_democrat2             3                0\n",
       "15            thefirstnews             2                0\n",
       "16             cbsmornings             2                1\n",
       "17              therecount             2                0\n",
       "18          itsrachelscott             2                1\n",
       "19            danielmichno             2                0"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "WITH ['president.putin.fanpage','viceworldnews','bikini.bottom.news','skynews','cheddygrace','xenasolo','cbsnews','world247breakingnews','abc15arizona','matthewcassel','aaronparnas6','planefinder','mihhail83','military_thingz','visegrad24','random.content99','politicsoftheworld','aviationhxb','cbsmornings','city__resident'] as users\n",
    " MATCH (u:user)-[r:recommends]->(a:user)\n",
    " WHERE u.id in users\n",
    "RETURN a.id as RecommendedAccount,count(*) as recommendCnt, a.verified as VerifiedAccount\n",
    "ORDER BY recommendCnt DESC\n",
    "\"\"\"\n",
    "lista=pd.DataFrame(graph.run(query).data())\n",
    "lista.head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "75a441f7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u.id</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>cbsmornings</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>aaronparnas6</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 u.id  VerifiedAccount\n",
       "0             skynews                1\n",
       "1         cbsmornings                1\n",
       "2       viceworldnews                1\n",
       "3  bikini.bottom.news                0\n",
       "4        aaronparnas6                0"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Accounts that recommend you \"c4news\"\n",
    "query = \"\"\"\n",
    "WITH ['president.putin.fanpage','viceworldnews','bikini.bottom.news','skynews','cheddygrace','xenasolo','cbsnews','world247breakingnews','abc15arizona','matthewcassel','aaronparnas6','planefinder','mihhail83','military_thingz','visegrad24','random.content99','politicsoftheworld','aviationhxb','cbsmornings','city__resident'] as users\n",
    " MATCH (u:user)-[r:recommends]->(a:user)\n",
    " WHERE u.id in users and a.id=\"c4news\"\n",
    "RETURN u.id ,u.verified as VerifiedAccount\n",
    "\n",
    "\"\"\"\n",
    "lista=pd.DataFrame(graph.run(query).data())\n",
    "lista"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "08b07ad3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u.id</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>cbsmornings</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      u.id  VerifiedAccount\n",
       "0  president.putin.fanpage                0\n",
       "1            viceworldnews                1\n",
       "2              cbsmornings                1"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Accounts that recommend you \"skynews\"\n",
    "query = \"\"\"\n",
    "WITH ['president.putin.fanpage','viceworldnews','bikini.bottom.news','skynews','cheddygrace','xenasolo','cbsnews','world247breakingnews','abc15arizona','matthewcassel','aaronparnas6','planefinder','mihhail83','military_thingz','visegrad24','random.content99','politicsoftheworld','aviationhxb','cbsmornings','city__resident'] as users\n",
    " MATCH (u:user)-[r:recommends]->(a:user)\n",
    " WHERE u.id in users and a.id=\"skynews\"\n",
    "RETURN u.id ,u.verified as VerifiedAccount\n",
    "\n",
    "\"\"\"\n",
    "lista=pd.DataFrame(graph.run(query).data())\n",
    "lista"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a1860da3",
   "metadata": {},
   "source": [
    "As we can see there is a clear winner when it comes to being recommended and it is the \"c4news\" account. Although there is no pattern, we can see how news content tends to recommend accounts that contain the term \"news\" or international content in their name."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ff12f30b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
