{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "faf2e7dc",
   "metadata": {},
   "source": [
    "## Tik Tok"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "c0c3b3ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import numpy as np\n",
    "from py2neo import Graph\n",
    "from py2neo import Node\n",
    "from py2neo import Relationship\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "# for some nlp secret sauce\n",
    "import nltk\n",
    "from textblob import TextBlob\n",
    "from textblob.sentiments import NaiveBayesAnalyzer\n",
    "from langdetect import detect_langs\n",
    "from langdetect import detect\n",
    "from nltk.sentiment.vader import SentimentIntensityAnalyzer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "80a82a75",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[nltk_data] Downloading package vader_lexicon to\n",
      "[nltk_data]     C:\\Users\\arual\\AppData\\Roaming\\nltk_data...\n",
      "[nltk_data]   Package vader_lexicon is already up-to-date!\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Run the next two lines as needed\n",
    "nltk.download('vader_lexicon')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f23d9a59",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[nltk_data] Downloading package punkt to\n",
      "[nltk_data]     C:\\Users\\arual\\AppData\\Roaming\\nltk_data...\n",
      "[nltk_data]   Package punkt is already up-to-date!\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nltk.download('punkt')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b7ec33a9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# update bolt port number and password as needed.\n",
    "# in Neo4j, start DB of choice, click on DB name, on right under Details tab note 'Bolt port'\n",
    "# Windows\n",
    "if os.name == 'nt':\n",
    "    graph = Graph(\"bolt://localhost:7687\", password='1234', name='neo4j')\n",
    "# Linux & Mac\n",
    "if os.name == 'posix':\n",
    "    graph = Graph(\"bolt://localhost:11003\", password='xxx', name='neo4j')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "24afcd6c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "(No data)"
      ],
      "text/plain": [
       "(No data)"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# I don't think this needs to be run every time\n",
    "query = \"\"\"\n",
    "CREATE INDEX USRIDX IF NOT EXISTS\n",
    "FOR (n:user)\n",
    "ON (n.id);\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "b5bde5a4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>s</th></tr><tr><td style=\"text-align:left\">(_342470:song {album: &#039;\\u0417\\u0435\\u043c\\u043b\\u044f&#039;, audioURLWithCookie: 0, authorName: &#039;\\u041e\\u043a\\u0435\\u0430\\u043d \\u0415\\u043b\\u044c\\u0437\\u0438&#039;, coverLarge: &#039;https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/0e057b52e54948e8a5d6ebc686ef8e3b~c5_720x720.jpeg&#039;, coverMedium: &#039;https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/0e057b52e54948e8a5d6ebc686ef8e3b~c5_200x200.jpeg&#039;, coverThumb: &#039;https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/0e057b52e54948e8a5d6ebc686ef8e3b~c5_100x100.jpeg&#039;, duration: 60, id: &#039;6718412074684254210&#039;, keyToken: &#039;&#039;, numVids: 19300, original: 0, playUrl: &#039;https://sf16-ies-music-va.tiktokcdn.com/obj/tos-useast2a-ve-2774/76156347b51b4cbaa836c9e444e5872b&#039;, private: 0, scheduleSearchTime: 0, title: &#039;\\u041e\\u0431\\u0456\\u0439\\u043c\\u0438&#039;})</td></tr><tr><td style=\"text-align:left\">(_343278:song {album: &#039;\\u041e\\u0431\\u0456\\u0439\\u043c\\u0438 - Remix&#039;, audioURLWithCookie: 0, authorName: &#039;\\u041e\\u043a\\u0435\\u0430\\u043d \\u0415\\u043b\\u044c\\u0437\\u0438&#039;, coverLarge: &#039;https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/60a559e85efd4e40877e660f651efdfd~c5_720x720.jpeg&#039;, coverMedium: &#039;https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/60a559e85efd4e40877e660f651efdfd~c5_200x200.jpeg&#039;, coverThumb: &#039;https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/60a559e85efd4e40877e660f651efdfd~c5_100x100.jpeg&#039;, duration: 60, id: &#039;6899164801193216002&#039;, keyToken: &#039;&#039;, numVids: &#039;6733&#039;, original: 0, playUrl: &#039;https://sf16-ies-music-va.tiktokcdn.com/obj/tos-useast2a-ve-2774/f2e8a7defbd44b08858d6c6d04eefc97&#039;, private: 0, scheduleSearchTime: 0, title: &#039;\\u041e\\u0431\\u0456\\u0439\\u043c\\u0438 - Remix&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " s                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   \n",
       "-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
       " (_342470:song {album: '\\u0417\\u0435\\u043c\\u043b\\u044f', audioURLWithCookie: 0, authorName: '\\u041e\\u043a\\u0435\\u0430\\u043d \\u0415\\u043b\\u044c\\u0437\\u0438', coverLarge: 'https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/0e057b52e54948e8a5d6ebc686ef8e3b~c5_720x720.jpeg', coverMedium: 'https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/0e057b52e54948e8a5d6ebc686ef8e3b~c5_200x200.jpeg', coverThumb: 'https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/0e057b52e54948e8a5d6ebc686ef8e3b~c5_100x100.jpeg', duration: 60, id: '6718412074684254210', keyToken: '', numVids: 19300, original: 0, playUrl: 'https://sf16-ies-music-va.tiktokcdn.com/obj/tos-useast2a-ve-2774/76156347b51b4cbaa836c9e444e5872b', private: 0, scheduleSearchTime: 0, title: '\\u041e\\u0431\\u0456\\u0439\\u043c\\u0438'})                        \n",
       " (_343278:song {album: '\\u041e\\u0431\\u0456\\u0439\\u043c\\u0438 - Remix', audioURLWithCookie: 0, authorName: '\\u041e\\u043a\\u0435\\u0430\\u043d \\u0415\\u043b\\u044c\\u0437\\u0438', coverLarge: 'https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/60a559e85efd4e40877e660f651efdfd~c5_720x720.jpeg', coverMedium: 'https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/60a559e85efd4e40877e660f651efdfd~c5_200x200.jpeg', coverThumb: 'https://p16-amd-va.tiktokcdn.com/img/tos-useast2a-v-2774/60a559e85efd4e40877e660f651efdfd~c5_100x100.jpeg', duration: 60, id: '6899164801193216002', keyToken: '', numVids: '6733', original: 0, playUrl: 'https://sf16-ies-music-va.tiktokcdn.com/obj/tos-useast2a-ve-2774/f2e8a7defbd44b08858d6c6d04eefc97', private: 0, scheduleSearchTime: 0, title: '\\u041e\\u0431\\u0456\\u0439\\u043c\\u0438 - Remix'}) "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Quick test to make sure things are connected and working. This Okean Elzy song should show up twice.\n",
    "query = \"\"\"\n",
    "MATCH (s:song) WHERE s.title =~ '.*Обійми.*' RETURN s;\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "bd2f74a1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>LikesReceived</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[cbsnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>153400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[yahoonews]</td>\n",
       "      <td>1</td>\n",
       "      <td>97800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[nbcnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>79200000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[underthedesknews]</td>\n",
       "      <td>1</td>\n",
       "      <td>76600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[nikocadodailynews]</td>\n",
       "      <td>0</td>\n",
       "      <td>71100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>[thegossipnewstribune]</td>\n",
       "      <td>0</td>\n",
       "      <td>23400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>[forcesnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>15600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>[ykrainews]</td>\n",
       "      <td>0</td>\n",
       "      <td>8886</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>[military_newss]</td>\n",
       "      <td>0</td>\n",
       "      <td>5307</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>[newswoow]</td>\n",
       "      <td>0</td>\n",
       "      <td>4695</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>72 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                  userName  VerifiedAccount  LikesReceived\n",
       "0                [cbsnews]                1      153400000\n",
       "1              [yahoonews]                1       97800000\n",
       "2                [nbcnews]                1       79200000\n",
       "3       [underthedesknews]                1       76600000\n",
       "4      [nikocadodailynews]                0       71100000\n",
       "..                     ...              ...            ...\n",
       "67  [thegossipnewstribune]                0          23400\n",
       "68            [forcesnews]                0          15600\n",
       "69             [ykrainews]                0           8886\n",
       "70        [military_newss]                0           5307\n",
       "71              [newswoow]                0           4695\n",
       "\n",
       "[72 rows x 3 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Most liked accounts related to news (not just official media )\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id =~ '.*new.*'\n",
    "RETURN COLLECT(DISTINCT u.id) AS userName, u.verified as VerifiedAccount , u.heartCount as LikesReceived\n",
    "ORDER BY LikesReceived DESC \n",
    "\"\"\"\n",
    "lista=pd.DataFrame(graph.run(query).data())\n",
    "lista\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "8bc8d635",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Followers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[nbcnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>2700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[cbsnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>2500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[underthedesknews]</td>\n",
       "      <td>1</td>\n",
       "      <td>2300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[abcnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>2100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[yahoonews, .thenewwave]</td>\n",
       "      <td>1</td>\n",
       "      <td>1700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>[world_news_clips]</td>\n",
       "      <td>0</td>\n",
       "      <td>2203</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>[ykrainews]</td>\n",
       "      <td>0</td>\n",
       "      <td>1198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>[thegossipnewstribune]</td>\n",
       "      <td>0</td>\n",
       "      <td>966</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>[military_newss]</td>\n",
       "      <td>0</td>\n",
       "      <td>922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>[newswoow]</td>\n",
       "      <td>0</td>\n",
       "      <td>275</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>74 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    userName  VerifiedAccount  Followers\n",
       "0                  [nbcnews]                1    2700000\n",
       "1                  [cbsnews]                1    2500000\n",
       "2         [underthedesknews]                1    2300000\n",
       "3                  [abcnews]                1    2100000\n",
       "4   [yahoonews, .thenewwave]                1    1700000\n",
       "..                       ...              ...        ...\n",
       "69        [world_news_clips]                0       2203\n",
       "70               [ykrainews]                0       1198\n",
       "71    [thegossipnewstribune]                0        966\n",
       "72          [military_newss]                0        922\n",
       "73                [newswoow]                0        275\n",
       "\n",
       "[74 rows x 3 columns]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Most followed account with any relation with media (We can see how in the top 10 we alredy have accounts that doesn't have anything to do with the conflict)\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id =~ '.*new.*'\n",
    "RETURN COLLECT(DISTINCT u.id) AS userName, u.verified as VerifiedAccount , u.followerCount as Followers\n",
    "ORDER BY Followers DESC ;\n",
    "\"\"\"\n",
    "lista=pd.DataFrame(graph.run(query).data())\n",
    "lista"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "f5323d3a",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Most followed account with any relation with media (We can see how in the top 10 we alredy have accounts that doesn't have anything to do with the conflict)\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id =~ '.*new.*' and \n",
    "v.desc =~ '.*war.*'\n",
    "RETURN COLLECT(DISTINCT u.id) AS userName, u.verified as VerifiedAccount , u.followerCount as Followers\n",
    "ORDER BY Followers DESC ;\n",
    "\"\"\"\n",
    "results1=pd.DataFrame(graph.run(query).data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "7174dc62",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Followers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[nbcnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>2700000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[cbsnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>2500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[donald_newshd]</td>\n",
       "      <td>0</td>\n",
       "      <td>1400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[viceworldnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>1300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[skynews, goodmorningbadnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>1100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[bikini.bottom.news]</td>\n",
       "      <td>0</td>\n",
       "      <td>1100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[world247breakingnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>397400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[btnewsroom]</td>\n",
       "      <td>0</td>\n",
       "      <td>320000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[quicktakenews]</td>\n",
       "      <td>1</td>\n",
       "      <td>189800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[caspolnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>128900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[c4news]</td>\n",
       "      <td>1</td>\n",
       "      <td>96200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[jayhawkdlonewolf]</td>\n",
       "      <td>0</td>\n",
       "      <td>47400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[24news4u]</td>\n",
       "      <td>0</td>\n",
       "      <td>32500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[picklenews]</td>\n",
       "      <td>0</td>\n",
       "      <td>31000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[bbcnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>30400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[aznews.ws]</td>\n",
       "      <td>0</td>\n",
       "      <td>25100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[ukraine.news.today]</td>\n",
       "      <td>0</td>\n",
       "      <td>21900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[latestconflictwarnews2]</td>\n",
       "      <td>0</td>\n",
       "      <td>21600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[thenewsmovement]</td>\n",
       "      <td>1</td>\n",
       "      <td>20600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[newz2you]</td>\n",
       "      <td>0</td>\n",
       "      <td>20200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[u24_news]</td>\n",
       "      <td>0</td>\n",
       "      <td>17100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[1newsnz]</td>\n",
       "      <td>1</td>\n",
       "      <td>12100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[.military.newss]</td>\n",
       "      <td>0</td>\n",
       "      <td>9914</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[ukrainerussianewsdaily]</td>\n",
       "      <td>0</td>\n",
       "      <td>9589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[thefirstnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>9245</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>[tv13news]</td>\n",
       "      <td>0</td>\n",
       "      <td>5276</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>[internationalnews12365]</td>\n",
       "      <td>0</td>\n",
       "      <td>3759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>[forcesnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>2633</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>[world_news_clips]</td>\n",
       "      <td>0</td>\n",
       "      <td>2203</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>[ykrainews]</td>\n",
       "      <td>0</td>\n",
       "      <td>1198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>[thegossipnewstribune]</td>\n",
       "      <td>0</td>\n",
       "      <td>966</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>[military_newss]</td>\n",
       "      <td>0</td>\n",
       "      <td>922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>[newswoow]</td>\n",
       "      <td>0</td>\n",
       "      <td>275</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         userName  VerifiedAccount  Followers\n",
       "0                       [nbcnews]                1    2700000\n",
       "1                       [cbsnews]                1    2500000\n",
       "2                 [donald_newshd]                0    1400000\n",
       "3                 [viceworldnews]                1    1300000\n",
       "4   [skynews, goodmorningbadnews]                1    1100000\n",
       "5            [bikini.bottom.news]                0    1100000\n",
       "6          [world247breakingnews]                0     397400\n",
       "7                    [btnewsroom]                0     320000\n",
       "8                 [quicktakenews]                1     189800\n",
       "9                    [caspolnews]                0     128900\n",
       "10                       [c4news]                1      96200\n",
       "11             [jayhawkdlonewolf]                0      47400\n",
       "12                     [24news4u]                0      32500\n",
       "13                   [picklenews]                0      31000\n",
       "14                      [bbcnews]                1      30400\n",
       "15                    [aznews.ws]                0      25100\n",
       "16           [ukraine.news.today]                0      21900\n",
       "17       [latestconflictwarnews2]                0      21600\n",
       "18              [thenewsmovement]                1      20600\n",
       "19                     [newz2you]                0      20200\n",
       "20                     [u24_news]                0      17100\n",
       "21                      [1newsnz]                1      12100\n",
       "22              [.military.newss]                0       9914\n",
       "23       [ukrainerussianewsdaily]                0       9589\n",
       "24                 [thefirstnews]                0       9245\n",
       "25                     [tv13news]                0       5276\n",
       "26       [internationalnews12365]                0       3759\n",
       "27                   [forcesnews]                0       2633\n",
       "28             [world_news_clips]                0       2203\n",
       "29                    [ykrainews]                0       1198\n",
       "30         [thegossipnewstribune]                0        966\n",
       "31               [military_newss]                0        922\n",
       "32                     [newswoow]                0        275"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "e5a000e7",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id =~ '.*new.*' and \n",
    "v.desc =~ '.*ukraine.*'\n",
    "RETURN COLLECT(DISTINCT u.id) AS userName, u.verified as VerifiedAccount , u.followerCount as Followers\n",
    "ORDER BY Followers DESC ;\n",
    "\"\"\"\n",
    "results2=pd.DataFrame(graph.run(query).data())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "a7436c34",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Followers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[cbsnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>2500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[viceworldnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>1300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[skynews, goodmorningbadnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>1100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[bikini.bottom.news]</td>\n",
       "      <td>0</td>\n",
       "      <td>1100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[news.com.au]</td>\n",
       "      <td>1</td>\n",
       "      <td>822800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[world247breakingnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>397400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[caspolnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>128900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[official__world_news]</td>\n",
       "      <td>0</td>\n",
       "      <td>48300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[jayhawkdlonewolf]</td>\n",
       "      <td>0</td>\n",
       "      <td>47400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[bbcnewsukrainian]</td>\n",
       "      <td>1</td>\n",
       "      <td>36000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[picklenews]</td>\n",
       "      <td>0</td>\n",
       "      <td>31000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[bbcnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>30400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[ukraine.news.today]</td>\n",
       "      <td>0</td>\n",
       "      <td>21900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[latestconflictwarnews2]</td>\n",
       "      <td>0</td>\n",
       "      <td>21600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[thenewsmovement]</td>\n",
       "      <td>1</td>\n",
       "      <td>20600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[newz2you]</td>\n",
       "      <td>0</td>\n",
       "      <td>20200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[u24_news]</td>\n",
       "      <td>0</td>\n",
       "      <td>17100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[1newsnz]</td>\n",
       "      <td>1</td>\n",
       "      <td>12100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[.military.newss]</td>\n",
       "      <td>0</td>\n",
       "      <td>9914</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[ukrainerussianewsdaily]</td>\n",
       "      <td>0</td>\n",
       "      <td>9589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[thefirstnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>9245</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[tv13news]</td>\n",
       "      <td>0</td>\n",
       "      <td>5276</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[internationalnews12365]</td>\n",
       "      <td>0</td>\n",
       "      <td>3759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[forcesnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>2633</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[world_news_clips]</td>\n",
       "      <td>0</td>\n",
       "      <td>2203</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>[ykrainews]</td>\n",
       "      <td>0</td>\n",
       "      <td>1198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>[thegossipnewstribune]</td>\n",
       "      <td>0</td>\n",
       "      <td>966</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>[military_newss]</td>\n",
       "      <td>0</td>\n",
       "      <td>922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>[newswoow]</td>\n",
       "      <td>0</td>\n",
       "      <td>275</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         userName  VerifiedAccount  Followers\n",
       "0                       [cbsnews]                1    2500000\n",
       "1                 [viceworldnews]                1    1300000\n",
       "2   [skynews, goodmorningbadnews]                1    1100000\n",
       "3            [bikini.bottom.news]                0    1100000\n",
       "4                   [news.com.au]                1     822800\n",
       "5          [world247breakingnews]                0     397400\n",
       "6                    [caspolnews]                0     128900\n",
       "7          [official__world_news]                0      48300\n",
       "8              [jayhawkdlonewolf]                0      47400\n",
       "9              [bbcnewsukrainian]                1      36000\n",
       "10                   [picklenews]                0      31000\n",
       "11                      [bbcnews]                1      30400\n",
       "12           [ukraine.news.today]                0      21900\n",
       "13       [latestconflictwarnews2]                0      21600\n",
       "14              [thenewsmovement]                1      20600\n",
       "15                     [newz2you]                0      20200\n",
       "16                     [u24_news]                0      17100\n",
       "17                      [1newsnz]                1      12100\n",
       "18              [.military.newss]                0       9914\n",
       "19       [ukrainerussianewsdaily]                0       9589\n",
       "20                 [thefirstnews]                0       9245\n",
       "21                     [tv13news]                0       5276\n",
       "22       [internationalnews12365]                0       3759\n",
       "23                   [forcesnews]                0       2633\n",
       "24             [world_news_clips]                0       2203\n",
       "25                    [ykrainews]                0       1198\n",
       "26         [thegossipnewstribune]                0        966\n",
       "27               [military_newss]                0        922\n",
       "28                     [newswoow]                0        275"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "7923aeaf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Followers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[cbsnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>2500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[donald_newshd]</td>\n",
       "      <td>0</td>\n",
       "      <td>1400000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[viceworldnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>1300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[skynews, goodmorningbadnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>1100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[bikini.bottom.news]</td>\n",
       "      <td>0</td>\n",
       "      <td>1100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[news.com.au]</td>\n",
       "      <td>1</td>\n",
       "      <td>822800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[world247breakingnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>397400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[caspolnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>128900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[factualnews77]</td>\n",
       "      <td>0</td>\n",
       "      <td>66900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[official__world_news]</td>\n",
       "      <td>0</td>\n",
       "      <td>48300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[jayhawkdlonewolf]</td>\n",
       "      <td>0</td>\n",
       "      <td>47400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[pack_of_newports]</td>\n",
       "      <td>0</td>\n",
       "      <td>43600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[bbcnewsukrainian]</td>\n",
       "      <td>1</td>\n",
       "      <td>36000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[picklenews]</td>\n",
       "      <td>0</td>\n",
       "      <td>31000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[bbcnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>30400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[aznews.ws]</td>\n",
       "      <td>0</td>\n",
       "      <td>25100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[ukraine.news.today]</td>\n",
       "      <td>0</td>\n",
       "      <td>21900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[latestconflictwarnews2]</td>\n",
       "      <td>0</td>\n",
       "      <td>21600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[thenewsmovement]</td>\n",
       "      <td>1</td>\n",
       "      <td>20600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[newz2you]</td>\n",
       "      <td>0</td>\n",
       "      <td>20200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[u24_news]</td>\n",
       "      <td>0</td>\n",
       "      <td>17100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[1newsnz]</td>\n",
       "      <td>1</td>\n",
       "      <td>12100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[.military.newss]</td>\n",
       "      <td>0</td>\n",
       "      <td>9914</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[ukrainerussianewsdaily]</td>\n",
       "      <td>0</td>\n",
       "      <td>9589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[thefirstnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>9245</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>[tv13news]</td>\n",
       "      <td>0</td>\n",
       "      <td>5276</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>[internationalnews12365]</td>\n",
       "      <td>0</td>\n",
       "      <td>3759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>[forcesnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>2633</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>[world_news_clips]</td>\n",
       "      <td>0</td>\n",
       "      <td>2203</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>[ykrainews]</td>\n",
       "      <td>0</td>\n",
       "      <td>1198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>[thegossipnewstribune]</td>\n",
       "      <td>0</td>\n",
       "      <td>966</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>[military_newss]</td>\n",
       "      <td>0</td>\n",
       "      <td>922</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>[newswoow]</td>\n",
       "      <td>0</td>\n",
       "      <td>275</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         userName  VerifiedAccount  Followers\n",
       "0                       [cbsnews]                1    2500000\n",
       "1                 [donald_newshd]                0    1400000\n",
       "2                 [viceworldnews]                1    1300000\n",
       "3   [skynews, goodmorningbadnews]                1    1100000\n",
       "4            [bikini.bottom.news]                0    1100000\n",
       "5                   [news.com.au]                1     822800\n",
       "6          [world247breakingnews]                0     397400\n",
       "7                    [caspolnews]                0     128900\n",
       "8                 [factualnews77]                0      66900\n",
       "9          [official__world_news]                0      48300\n",
       "10             [jayhawkdlonewolf]                0      47400\n",
       "11             [pack_of_newports]                0      43600\n",
       "12             [bbcnewsukrainian]                1      36000\n",
       "13                   [picklenews]                0      31000\n",
       "14                      [bbcnews]                1      30400\n",
       "15                    [aznews.ws]                0      25100\n",
       "16           [ukraine.news.today]                0      21900\n",
       "17       [latestconflictwarnews2]                0      21600\n",
       "18              [thenewsmovement]                1      20600\n",
       "19                     [newz2you]                0      20200\n",
       "20                     [u24_news]                0      17100\n",
       "21                      [1newsnz]                1      12100\n",
       "22              [.military.newss]                0       9914\n",
       "23       [ukrainerussianewsdaily]                0       9589\n",
       "24                 [thefirstnews]                0       9245\n",
       "25                     [tv13news]                0       5276\n",
       "26       [internationalnews12365]                0       3759\n",
       "27                   [forcesnews]                0       2633\n",
       "28             [world_news_clips]                0       2203\n",
       "29                    [ykrainews]                0       1198\n",
       "30         [thegossipnewstribune]                0        966\n",
       "31               [military_newss]                0        922\n",
       "32                     [newswoow]                0        275"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id =~ '.*new.*' and \n",
    "v.desc =~ '.*russia.*'\n",
    "RETURN COLLECT(DISTINCT u.id) AS userName, u.verified as VerifiedAccount , u.followerCount as Followers\n",
    "ORDER BY Followers DESC ;\n",
    "\"\"\"\n",
    "results3=pd.DataFrame(graph.run(query).data())\n",
    "results3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "8171620a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Followers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[cbsnews]</td>\n",
       "      <td>1</td>\n",
       "      <td>2500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[skynews]</td>\n",
       "      <td>1</td>\n",
       "      <td>1100000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[caspolnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>128900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[latestconflictwarnews2]</td>\n",
       "      <td>0</td>\n",
       "      <td>21600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[thenewsmovement]</td>\n",
       "      <td>1</td>\n",
       "      <td>20600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[forcesnews]</td>\n",
       "      <td>0</td>\n",
       "      <td>2633</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[world_news_clips]</td>\n",
       "      <td>0</td>\n",
       "      <td>2203</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[thegossipnewstribune]</td>\n",
       "      <td>0</td>\n",
       "      <td>966</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[military_newss]</td>\n",
       "      <td>0</td>\n",
       "      <td>922</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   userName  VerifiedAccount  Followers\n",
       "0                 [cbsnews]                1    2500000\n",
       "1                 [skynews]                1    1100000\n",
       "2              [caspolnews]                0     128900\n",
       "3  [latestconflictwarnews2]                0      21600\n",
       "4         [thenewsmovement]                1      20600\n",
       "5              [forcesnews]                0       2633\n",
       "6        [world_news_clips]                0       2203\n",
       "7    [thegossipnewstribune]                0        966\n",
       "8          [military_newss]                0        922"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id =~ '.*new.*' and \n",
    "v.desc =~ '.*conflict.*'\n",
    "RETURN COLLECT(DISTINCT u.id) AS userName, u.verified as VerifiedAccount , u.followerCount as Followers\n",
    "ORDER BY Followers DESC ;\n",
    "\"\"\"\n",
    "results4=pd.DataFrame(graph.run(query).data())\n",
    "results4"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "05aa5fbc",
   "metadata": {},
   "source": [
    "Maybe this last one is too small to look for a intersection, so lest just pick the first three "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "f285a8d7",
   "metadata": {},
   "outputs": [],
   "source": [
    "#If you check for the suggested acounts for the most popular news accounts, it doesn't really relate you to just new's content.\n",
    "#Maybe it'll be good to implement a loop to look for the intersection among the first ten to see if TIKTOK is trying to \n",
    "#share just the same accounts under his algorithms.\n",
    "#What would we understand as ukraine/russia related?"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "072dcae6",
   "metadata": {},
   "source": [
    "The following Data Frames sort the accounts by streams, filtering by mentioning the war, conflict, ukraine and russia."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "ae081c0d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>12</td>\n",
       "      <td>39</td>\n",
       "      <td>36651600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>18</td>\n",
       "      <td>738</td>\n",
       "      <td>33906575</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>767</td>\n",
       "      <td>31600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>242</td>\n",
       "      <td>30406300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>authentictimetraveler</td>\n",
       "      <td>0</td>\n",
       "      <td>7</td>\n",
       "      <td>112</td>\n",
       "      <td>27760800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>119</th>\n",
       "      <td>wanhedaa</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>141</td>\n",
       "      <td>2042</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>120</th>\n",
       "      <td>karlemmrich</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1376</td>\n",
       "      <td>1688</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>militaryforces.com</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>156</td>\n",
       "      <td>1570</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>ivxxuk</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>143</td>\n",
       "      <td>1206</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>thealetheiaproject</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>15</td>\n",
       "      <td>1092</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>124 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    userName  VerifiedAccount  VidRelated  Totalvid   Streams\n",
       "0         bikini.bottom.news                0          12        39  36651600\n",
       "1                    skynews                1          18       738  33906575\n",
       "2                cheddygrace                0           1       767  31600000\n",
       "3    president.putin.fanpage                0          15       242  30406300\n",
       "4      authentictimetraveler                0           7       112  27760800\n",
       "..                       ...              ...         ...       ...       ...\n",
       "119                 wanhedaa                0           1       141      2042\n",
       "120              karlemmrich                0           1      1376      1688\n",
       "121       militaryforces.com                0           1       156      1570\n",
       "122                   ivxxuk                0           1       143      1206\n",
       "123       thealetheiaproject                0           1        15      1092\n",
       "\n",
       "[124 rows x 5 columns]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#War\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE (u.id =~ '.*news.*' OR\n",
    "      v.desc =~ '.*news.*' OR\n",
    "      v.desc =~ '.*новини.*' OR \n",
    "      v.desc =~ '.*Новости.*') AND \n",
    "      (v.desc =~ '.*war.*' OR\n",
    "      v.desc =~ '.*війни.*' OR\n",
    "      v.desc =~ '.*война.*')\n",
    "RETURN  u.id AS userName, u.verified as VerifiedAccount,count(v) as VidRelated,u.videoCount as Totalvid,sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\"\n",
    "war=pd.DataFrame(graph.run(query).data())\n",
    "war"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "dd357ee4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "19"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "war[\"VerifiedAccount\"].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "id": "70f0fe79",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.1532258064516129"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#proportion of verified accounts\n",
    "19/124"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "511bb4f4",
   "metadata": {},
   "outputs": [],
   "source": [
    "users1=war[\"userName\"].to_list()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "714cc6c7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>megatmurad</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>32</td>\n",
       "      <td>39641600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>14</td>\n",
       "      <td>39</td>\n",
       "      <td>37147500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>738</td>\n",
       "      <td>32625800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>767</td>\n",
       "      <td>31600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>16</td>\n",
       "      <td>242</td>\n",
       "      <td>30492700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>r3dwyn</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>31</td>\n",
       "      <td>1974</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>126</th>\n",
       "      <td>militaryforces.com</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>156</td>\n",
       "      <td>1570</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>127</th>\n",
       "      <td>linkyfirsttiktok</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>114</td>\n",
       "      <td>1214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>128</th>\n",
       "      <td>thealetheiaproject</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>15</td>\n",
       "      <td>1092</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>129</th>\n",
       "      <td>the_ghost_ace_of_kiev</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>257</td>\n",
       "      <td>135</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>130 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    userName  VerifiedAccount  VidRelated  Totalvid   Streams\n",
       "0                 megatmurad                0          15        32  39641600\n",
       "1         bikini.bottom.news                0          14        39  37147500\n",
       "2                    skynews                1           2       738  32625800\n",
       "3                cheddygrace                0           1       767  31600000\n",
       "4    president.putin.fanpage                0          16       242  30492700\n",
       "..                       ...              ...         ...       ...       ...\n",
       "125                   r3dwyn                0           1        31      1974\n",
       "126       militaryforces.com                0           1       156      1570\n",
       "127         linkyfirsttiktok                0           2       114      1214\n",
       "128       thealetheiaproject                0           1        15      1092\n",
       "129    the_ghost_ace_of_kiev                0           1       257       135\n",
       "\n",
       "[130 rows x 5 columns]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Ukraine\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE (u.id =~ '.*news.*' OR\n",
    "      v.desc =~ '.*news.*' OR\n",
    "      v.desc =~ '.*новини.*' OR \n",
    "      v.desc =~ '.*Новости.*') AND \n",
    "      (v.desc =~ '.*ukraine.*' OR\n",
    "      v.desc =~ '.*україни.*'OR\n",
    "      v.desc =~ '.*Украина.*')\n",
    "RETURN  u.id AS userName, u.verified as VerifiedAccount,count(v) as VidRelated,u.videoCount as Totalvid,sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\"\n",
    "ukraine=pd.DataFrame(graph.run(query).data())\n",
    "ukraine"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "077ed82f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "18"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ukraine[\"VerifiedAccount\"].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "id": "3a49bbdc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.13846153846153847"
      ]
     },
     "execution_count": 104,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#proportion of verified accounts\n",
    "18/130"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "569243af",
   "metadata": {},
   "outputs": [],
   "source": [
    "users2=ukraine[\"userName\"].to_list()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "267568cd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>16</td>\n",
       "      <td>242</td>\n",
       "      <td>39692700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>megatmurad</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>32</td>\n",
       "      <td>39641600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>14</td>\n",
       "      <td>39</td>\n",
       "      <td>37147500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>738</td>\n",
       "      <td>32649600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>767</td>\n",
       "      <td>31600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>120</th>\n",
       "      <td>militaryforces.com</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>156</td>\n",
       "      <td>1570</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>linkyfirsttiktok</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>114</td>\n",
       "      <td>1214</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>thealetheiaproject</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>15</td>\n",
       "      <td>1092</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>ykrainews</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>16</td>\n",
       "      <td>408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>crazyniiiik</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>32</td>\n",
       "      <td>163</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>125 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    userName  VerifiedAccount  VidRelated  Totalvid   Streams\n",
       "0    president.putin.fanpage                0          16       242  39692700\n",
       "1                 megatmurad                0          15        32  39641600\n",
       "2         bikini.bottom.news                0          14        39  37147500\n",
       "3                    skynews                1           3       738  32649600\n",
       "4                cheddygrace                0           1       767  31600000\n",
       "..                       ...              ...         ...       ...       ...\n",
       "120       militaryforces.com                0           1       156      1570\n",
       "121         linkyfirsttiktok                0           2       114      1214\n",
       "122       thealetheiaproject                0           1        15      1092\n",
       "123                ykrainews                0           1        16       408\n",
       "124              crazyniiiik                0           1        32       163\n",
       "\n",
       "[125 rows x 5 columns]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Russia\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE (u.id =~ '.*news.*' OR\n",
    "      v.desc =~ '.*news.*' OR\n",
    "      v.desc =~ '.*новини.*'  OR \n",
    "      v.desc =~ '.*Новости.*') AND \n",
    "      (v.desc =~ '.*russia.*' OR\n",
    "      v.desc =~ '.*Росія.*' OR\n",
    "      v.desc =~ '.*Россия.*')\n",
    "RETURN  u.id AS userName, u.verified as VerifiedAccount,count(v) as VidRelated,u.videoCount as Totalvid,sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\"\n",
    "russia=pd.DataFrame(graph.run(query).data())\n",
    "russia"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "3f6f5676",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "18"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "russia[\"VerifiedAccount\"].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "a6d25f87",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.144"
      ]
     },
     "execution_count": 105,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#proportion of verified accounts\n",
    "18/125"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "1787e7b9",
   "metadata": {},
   "outputs": [],
   "source": [
    "users3=russia[\"userName\"].to_list()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "118a9ebd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>caspolnews</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>404</td>\n",
       "      <td>9341700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>therealisticfishhead</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>90</td>\n",
       "      <td>5300000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>themsinstem</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>339</td>\n",
       "      <td>5105004</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>latestconflictwarnews2</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "      <td>98</td>\n",
       "      <td>1338500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>lordeedge</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>1348</td>\n",
       "      <td>993200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>fundiambb1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>481</td>\n",
       "      <td>706700</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>thegossipnewstribune</td>\n",
       "      <td>0</td>\n",
       "      <td>27</td>\n",
       "      <td>32</td>\n",
       "      <td>532612</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world_news_clips</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>26</td>\n",
       "      <td>347287</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>project_bandito</td>\n",
       "      <td>0</td>\n",
       "      <td>27</td>\n",
       "      <td>44</td>\n",
       "      <td>323462</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>wearescotland</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>740</td>\n",
       "      <td>306500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>howya.now</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "      <td>121</td>\n",
       "      <td>268389</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>sardar.rehan</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1456</td>\n",
       "      <td>264400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>thedailyrundown</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "      <td>113</td>\n",
       "      <td>259790</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>thenewsmovement</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>185</td>\n",
       "      <td>258900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>military_newss</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>250009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>738</td>\n",
       "      <td>225800</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ca_astronorthstarph</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>796</td>\n",
       "      <td>202200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>tiktok__czech</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>8</td>\n",
       "      <td>186300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>3706</td>\n",
       "      <td>134900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>69</td>\n",
       "      <td>123600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>seoulsecrets</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>351</td>\n",
       "      <td>106400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>supercad55</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>47</td>\n",
       "      <td>69551</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>countdaedalus</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>130</td>\n",
       "      <td>47900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>dailyrundownwithchris</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1008</td>\n",
       "      <td>34300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>cazacaza23</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>105</td>\n",
       "      <td>29936</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>forcesnews</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>23</td>\n",
       "      <td>25304</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>crazyniiiik</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>32</td>\n",
       "      <td>19251</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>relevanttopics</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>390</td>\n",
       "      <td>13793</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>cnn</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>210</td>\n",
       "      <td>12100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>robertjackcutter</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>391</td>\n",
       "      <td>9295</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>theverymessyworld</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>215</td>\n",
       "      <td>789</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  userName  VerifiedAccount  VidRelated  Totalvid  Streams\n",
       "0               caspolnews                0           3       404  9341700\n",
       "1     therealisticfishhead                0           1        90  5300000\n",
       "2              themsinstem                0          15       339  5105004\n",
       "3   latestconflictwarnews2                0           5        98  1338500\n",
       "4                lordeedge                0           2      1348   993200\n",
       "5               fundiambb1                0           1       481   706700\n",
       "6     thegossipnewstribune                0          27        32   532612\n",
       "7         world_news_clips                0           2        26   347287\n",
       "8          project_bandito                0          27        44   323462\n",
       "9            wearescotland                0           1       740   306500\n",
       "10               howya.now                0           8       121   268389\n",
       "11            sardar.rehan                0           1      1456   264400\n",
       "12         thedailyrundown                0           8       113   259790\n",
       "13         thenewsmovement                1           1       185   258900\n",
       "14          military_newss                0           4         5   250009\n",
       "15                 skynews                1           1       738   225800\n",
       "16     ca_astronorthstarph                0           1       796   202200\n",
       "17           tiktok__czech                0           1         8   186300\n",
       "18                 cbsnews                1           1      3706   134900\n",
       "19          city__resident                0           2        69   123600\n",
       "20            seoulsecrets                0           1       351   106400\n",
       "21              supercad55                0           4        47    69551\n",
       "22           countdaedalus                0           1       130    47900\n",
       "23   dailyrundownwithchris                0           1      1008    34300\n",
       "24              cazacaza23                0           4       105    29936\n",
       "25              forcesnews                0           3        23    25304\n",
       "26             crazyniiiik                0           4        32    19251\n",
       "27          relevanttopics                0           3       390    13793\n",
       "28                     cnn                1           1       210    12100\n",
       "29        robertjackcutter                0           1       391     9295\n",
       "30       theverymessyworld                0           1       215      789"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Conflict\n",
    "query = \"\"\"\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE (u.id =~ '.*new.*' OR\n",
    "      v.desc =~ '.*news.*' OR\n",
    "      v.desc =~ '.*новини.*'  OR \n",
    "      v.desc =~ '.*Новости.*') AND \n",
    "      (v.desc =~ '.*conflict.*' OR\n",
    "      v.desc =~ '.*конфлікт.*' OR\n",
    "      v.desc =~ '.*конфликт.*')\n",
    "RETURN  u.id AS userName, u.verified as VerifiedAccount,count(v) as VidRelated,u.videoCount as Totalvid,sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\"\n",
    "conflict=pd.DataFrame(graph.run(query).data())\n",
    "conflict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "b6db84ad",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conflict[\"VerifiedAccount\"].sum()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "ddeb464d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.12903225806451613"
      ]
     },
     "execution_count": 106,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#proportion of verified accounts\n",
    "4/31"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "756fd11e",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\fromnumeric.py:3474: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\_methods.py:189: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n",
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\fromnumeric.py:3474: RuntimeWarning: Mean of empty slice.\n",
      "  return _methods._mean(a, axis=axis, dtype=dtype,\n",
      "c:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\numpy\\core\\_methods.py:189: RuntimeWarning: invalid value encountered in double_scalars\n",
      "  ret = ret.dtype.type(ret / rcount)\n"
     ]
    }
   ],
   "source": [
    "#Scoring each account by the descriptions of their videos related to the war, ukraine and russia\n",
    "sai = SentimentIntensityAnalyzer()\n",
    "news=conflict[\"userName\"]\n",
    "for index, new in enumerate(news):\n",
    "    score=[]\n",
    "    query = \"\"\"\n",
    "    MATCH (u:user)-[a:author]->(v:video)\n",
    "    WHERE u.id =~ '%s' and\n",
    "          (v.desc =~ '.*conflict.*' OR\n",
    "      v.desc =~ '.*конфлікт.*' OR\n",
    "      v.desc =~ '.*конфликт.*')\n",
    "    RETURN v.desc AS description; \n",
    "    \"\"\" % new\n",
    "    # the % new inserts value of new where the %s is in the WHERE statement\n",
    "    result=pd.DataFrame(graph.run(query).data())\n",
    "    if (len(result)!=0):\n",
    "        for sentence in result['description']:\n",
    "            lang = detect(sentence)\n",
    "            if lang=='en':\n",
    "                kvp = sai.polarity_scores(sentence)\n",
    "                score.append(kvp['compound'])\n",
    "        #print(new,'has mean sentiment score of', round(np.mean(score),3),'from', len(score),'videos')\n",
    "        #print()\n",
    "        conflict.at[index, \"Score\"]=round(np.mean(score),3)\n",
    "        \n",
    "    else:\n",
    "        print(new,'returned no results in video description')\n",
    "        print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "id": "e865e91c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>VidRelated</th>\n",
       "      <th>Totalvid</th>\n",
       "      <th>Streams</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>caspolnews</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>404</td>\n",
       "      <td>9341700</td>\n",
       "      <td>-0.127</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>therealisticfishhead</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>90</td>\n",
       "      <td>5300000</td>\n",
       "      <td>-0.318</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>themsinstem</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>339</td>\n",
       "      <td>5105004</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>latestconflictwarnews2</td>\n",
       "      <td>0</td>\n",
       "      <td>5</td>\n",
       "      <td>98</td>\n",
       "      <td>1338500</td>\n",
       "      <td>-0.260</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>lordeedge</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>1348</td>\n",
       "      <td>993200</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>fundiambb1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>481</td>\n",
       "      <td>706700</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>thegossipnewstribune</td>\n",
       "      <td>0</td>\n",
       "      <td>27</td>\n",
       "      <td>32</td>\n",
       "      <td>532612</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world_news_clips</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>26</td>\n",
       "      <td>347287</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>project_bandito</td>\n",
       "      <td>0</td>\n",
       "      <td>27</td>\n",
       "      <td>44</td>\n",
       "      <td>323462</td>\n",
       "      <td>-0.015</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>wearescotland</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>740</td>\n",
       "      <td>306500</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>howya.now</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "      <td>121</td>\n",
       "      <td>268389</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>sardar.rehan</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1456</td>\n",
       "      <td>264400</td>\n",
       "      <td>-0.511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>thedailyrundown</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "      <td>113</td>\n",
       "      <td>259790</td>\n",
       "      <td>-0.045</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>thenewsmovement</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>185</td>\n",
       "      <td>258900</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>military_newss</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>250009</td>\n",
       "      <td>-0.059</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>738</td>\n",
       "      <td>225800</td>\n",
       "      <td>-0.361</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ca_astronorthstarph</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>796</td>\n",
       "      <td>202200</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>tiktok__czech</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>8</td>\n",
       "      <td>186300</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>3706</td>\n",
       "      <td>134900</td>\n",
       "      <td>0.459</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>2</td>\n",
       "      <td>69</td>\n",
       "      <td>123600</td>\n",
       "      <td>0.056</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>seoulsecrets</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>351</td>\n",
       "      <td>106400</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>supercad55</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>47</td>\n",
       "      <td>69551</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>countdaedalus</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>130</td>\n",
       "      <td>47900</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>dailyrundownwithchris</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1008</td>\n",
       "      <td>34300</td>\n",
       "      <td>-0.382</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>cazacaza23</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>105</td>\n",
       "      <td>29936</td>\n",
       "      <td>-0.055</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>forcesnews</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>23</td>\n",
       "      <td>25304</td>\n",
       "      <td>-0.005</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>crazyniiiik</td>\n",
       "      <td>0</td>\n",
       "      <td>4</td>\n",
       "      <td>32</td>\n",
       "      <td>19251</td>\n",
       "      <td>-0.034</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>relevanttopics</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>390</td>\n",
       "      <td>13793</td>\n",
       "      <td>-0.309</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>cnn</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>210</td>\n",
       "      <td>12100</td>\n",
       "      <td>-0.913</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>robertjackcutter</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>391</td>\n",
       "      <td>9295</td>\n",
       "      <td>-0.604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>theverymessyworld</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>215</td>\n",
       "      <td>789</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  userName  VerifiedAccount  VidRelated  Totalvid  Streams  \\\n",
       "0               caspolnews                0           3       404  9341700   \n",
       "1     therealisticfishhead                0           1        90  5300000   \n",
       "2              themsinstem                0          15       339  5105004   \n",
       "3   latestconflictwarnews2                0           5        98  1338500   \n",
       "4                lordeedge                0           2      1348   993200   \n",
       "5               fundiambb1                0           1       481   706700   \n",
       "6     thegossipnewstribune                0          27        32   532612   \n",
       "7         world_news_clips                0           2        26   347287   \n",
       "8          project_bandito                0          27        44   323462   \n",
       "9            wearescotland                0           1       740   306500   \n",
       "10               howya.now                0           8       121   268389   \n",
       "11            sardar.rehan                0           1      1456   264400   \n",
       "12         thedailyrundown                0           8       113   259790   \n",
       "13         thenewsmovement                1           1       185   258900   \n",
       "14          military_newss                0           4         5   250009   \n",
       "15                 skynews                1           1       738   225800   \n",
       "16     ca_astronorthstarph                0           1       796   202200   \n",
       "17           tiktok__czech                0           1         8   186300   \n",
       "18                 cbsnews                1           1      3706   134900   \n",
       "19          city__resident                0           2        69   123600   \n",
       "20            seoulsecrets                0           1       351   106400   \n",
       "21              supercad55                0           4        47    69551   \n",
       "22           countdaedalus                0           1       130    47900   \n",
       "23   dailyrundownwithchris                0           1      1008    34300   \n",
       "24              cazacaza23                0           4       105    29936   \n",
       "25              forcesnews                0           3        23    25304   \n",
       "26             crazyniiiik                0           4        32    19251   \n",
       "27          relevanttopics                0           3       390    13793   \n",
       "28                     cnn                1           1       210    12100   \n",
       "29        robertjackcutter                0           1       391     9295   \n",
       "30       theverymessyworld                0           1       215      789   \n",
       "\n",
       "    Score  \n",
       "0  -0.127  \n",
       "1  -0.318  \n",
       "2   0.000  \n",
       "3  -0.260  \n",
       "4   0.000  \n",
       "5   0.000  \n",
       "6   0.000  \n",
       "7   0.000  \n",
       "8  -0.015  \n",
       "9   0.000  \n",
       "10  0.000  \n",
       "11 -0.511  \n",
       "12 -0.045  \n",
       "13    NaN  \n",
       "14 -0.059  \n",
       "15 -0.361  \n",
       "16  0.000  \n",
       "17  0.000  \n",
       "18  0.459  \n",
       "19  0.056  \n",
       "20    NaN  \n",
       "21  0.000  \n",
       "22  0.000  \n",
       "23 -0.382  \n",
       "24 -0.055  \n",
       "25 -0.005  \n",
       "26 -0.034  \n",
       "27 -0.309  \n",
       "28 -0.913  \n",
       "29 -0.604  \n",
       "30  0.000  "
      ]
     },
     "execution_count": 113,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conflict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "00f09b13",
   "metadata": {},
   "outputs": [],
   "source": [
    "users4=conflict[\"userName\"].to_list()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "563789a8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-0.12010344827586207"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conflict[\"Score\"].mean()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ad260fcf",
   "metadata": {},
   "source": [
    "es practicamente el mismo porcentaje que en los demás casos, simplemente es una cuarta parte de los datos recogidos en los demás casos :/\n",
    "Conflict seems to be the less used word, so we'll study it apart, to keep the numbers compensate. \n",
    "Let's study a little the type of messages comming from them. Descriptions are also condening the war with negative sensitivity."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "id": "87b832f1",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Intersection of the different list of accounts (war/ukraine/russia)\n",
    "users=list(set(users1) & set(users2)& set(users3))\n",
    "\n",
    "#Including the russian terminology doesn't affect the number of any list\n",
    "\n",
    "prueba=list(set(users1) & set(users2)& set(users3) & set(users4))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "id": "5390b331",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['latestconflictwarnews2',\n",
       " 'skynews',\n",
       " 'therealisticfishhead',\n",
       " 'lordeedge',\n",
       " 'supercad55',\n",
       " 'robertjackcutter',\n",
       " 'dailyrundownwithchris',\n",
       " 'theverymessyworld',\n",
       " 'fundiambb1',\n",
       " 'city__resident',\n",
       " 'thenewsmovement',\n",
       " 'thegossipnewstribune',\n",
       " 'cnn',\n",
       " 'howya.now',\n",
       " 'relevanttopics',\n",
       " 'themsinstem',\n",
       " 'project_bandito',\n",
       " 'cbsnews',\n",
       " 'tiktok__czech',\n",
       " 'military_newss',\n",
       " 'countdaedalus',\n",
       " 'ca_astronorthstarph',\n",
       " 'crazyniiiik',\n",
       " 'thedailyrundown',\n",
       " 'seoulsecrets',\n",
       " 'forcesnews',\n",
       " 'caspolnews',\n",
       " 'world_news_clips',\n",
       " 'cazacaza23']"
      ]
     },
     "execution_count": 117,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "prueba"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d9e2ddc0",
   "metadata": {},
   "source": [
    "Podemos concluir ya de antemano, que tiktok no es una plataforma muy usada por medios tradicionales, ya que en nuestros filtros, el número demedios verificados no superan el 15% en ninguno de los casos "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3fa1ab24",
   "metadata": {},
   "outputs": [],
   "source": [
    "#should we filter by the visualizations of the war-related content or the general stream of the content? \n",
    "#That's just changing the WHERE quote"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "2089d3f2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Streams</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>48940200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>1</td>\n",
       "      <td>41258500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>37147500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>34132375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>31600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>xenasolo</td>\n",
       "      <td>0</td>\n",
       "      <td>30629200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>24747400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world247breakingnews</td>\n",
       "      <td>0</td>\n",
       "      <td>24664271</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>abc15arizona</td>\n",
       "      <td>1</td>\n",
       "      <td>23950384</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>matthewcassel</td>\n",
       "      <td>0</td>\n",
       "      <td>23114400</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>aaronparnas6</td>\n",
       "      <td>0</td>\n",
       "      <td>20800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>planefinder</td>\n",
       "      <td>1</td>\n",
       "      <td>19829600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>mihhail83</td>\n",
       "      <td>0</td>\n",
       "      <td>17416100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>military_thingz</td>\n",
       "      <td>0</td>\n",
       "      <td>16800000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>visegrad24</td>\n",
       "      <td>0</td>\n",
       "      <td>16694300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>random.content99</td>\n",
       "      <td>0</td>\n",
       "      <td>15100801</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>politicsoftheworld</td>\n",
       "      <td>0</td>\n",
       "      <td>14466600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>aviationhxb</td>\n",
       "      <td>0</td>\n",
       "      <td>13926300</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsmornings</td>\n",
       "      <td>1</td>\n",
       "      <td>12221719</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>11974702</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   userName  VerifiedAccount   Streams\n",
       "0   president.putin.fanpage                0  48940200\n",
       "1             viceworldnews                1  41258500\n",
       "2        bikini.bottom.news                0  37147500\n",
       "3                   skynews                1  34132375\n",
       "4               cheddygrace                0  31600000\n",
       "5                  xenasolo                0  30629200\n",
       "6                   cbsnews                1  24747400\n",
       "7      world247breakingnews                0  24664271\n",
       "8              abc15arizona                1  23950384\n",
       "9             matthewcassel                0  23114400\n",
       "10             aaronparnas6                0  20800000\n",
       "11              planefinder                1  19829600\n",
       "12                mihhail83                0  17416100\n",
       "13          military_thingz                0  16800000\n",
       "14               visegrad24                0  16694300\n",
       "15         random.content99                0  15100801\n",
       "16       politicsoftheworld                0  14466600\n",
       "17              aviationhxb                0  13926300\n",
       "18              cbsmornings                1  12221719\n",
       "19           city__resident                0  11974702"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#First we will sort the list of the users by streaming again and we will select the main 20\n",
    "query=  \"\"\"\n",
    "WITH ['president.putin.fanpage','frankdomenic','random.content99','bbcnewsukrainian','ykrainews','joy_enjoy6','themsinstem',\n",
    "'project_bandito','ervesto77','about_ww3','tiktok__czech','picklenews','visegrad24','newswoow','abc15arizona','dogedave',\n",
    " 'tip_berlin','ukrainerussianewsdaily','papakreem','militaryforces.com','dark_engine84','whitecheddarbread','caspolnews',\n",
    " 'tv13news','world_news_clips','cbsmornings','crease19','lordeedge','dailyrundownwithchris','theverymessyworld','fundiambb1',\n",
    " 'viceworldnews','aaronparnas6','internationalnews12365','bigmike3223','cheddygrace','cbsnews','matthewcassel','seoulsecrets',\n",
    " 'world247breakingnews','an4e216','latestconflictwarnews2','military_thingz','goodmorningbadnews','supercad55','robertjackcutter',\n",
    " 'aviationhxb','morriganamber','thenewsmovement','belgian_warrior_group','relevanttopics','stand.with.ukraine.now','iam.rob21',\n",
    " 'david.heath','military_newss','dailymail','xenasolo','gregmustreader','eurovision.by.kseniia','ca_astronorthstarph',\n",
    " 'crazyniiiik','planefinder','thealetheiaproject','ukraine.news.today','the_ghost_ace_of_kiev','forcesnews',\n",
    " 'newz2you','bbcnews','s1xrey','.military.newss','highlightsideline','skynews','therealisticfishhead','_rachtok_','city__resident',\n",
    " 'u24_news','thegossipnewstribune','cnn','sashareheylo','howya.now','politicsoftheworld','snoopy.vn','frankorando','mihhail83',\n",
    " 'thefirstnews','healingwithirina','themiracle35','thehistorylegends','astridszarek','countdaedalus','ukraine_latest','thedailyrundown',\n",
    " 'christina_hrystya','bikini.bottom.news','ukraine_war_1','bigkingpiz','zeitimbild','1newsnz','cazacaza23'] as users\n",
    "MATCH (u:user)-[:author]->(v:video)\n",
    "WHERE u.id in users and\n",
    "          (v.desc =~ '.*ukraine.*' OR\n",
    "          v.desc =~ '.*war.*' OR \n",
    "          v.desc =~ '.*russia.*')\n",
    "RETURN   u.id AS userName, u.verified as VerifiedAccount , sum(v.playCount) as Streams\n",
    "ORDER BY Streams DESC ;\n",
    "\"\"\" \n",
    "sortedusers=pd.DataFrame(graph.run(query).data()).head(20)\n",
    "sortedusers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "c9d2ce2e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "6"
      ]
     },
     "execution_count": 86,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sortedusers[\"VerifiedAccount\"].sum()\n",
    "#We can see how is less that the 50% of the most consumed accounts \n",
    "#If we filter the ussers by the videos it drops 1 unit"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "id": "3f2b1bab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['president.putin.fanpage',\n",
       " 'viceworldnews',\n",
       " 'bikini.bottom.news',\n",
       " 'skynews',\n",
       " 'cheddygrace',\n",
       " 'xenasolo',\n",
       " 'cbsnews',\n",
       " 'world247breakingnews',\n",
       " 'abc15arizona',\n",
       " 'matthewcassel',\n",
       " 'aaronparnas6',\n",
       " 'planefinder',\n",
       " 'mihhail83',\n",
       " 'military_thingz',\n",
       " 'visegrad24',\n",
       " 'random.content99',\n",
       " 'politicsoftheworld',\n",
       " 'aviationhxb',\n",
       " 'cbsmornings',\n",
       " 'city__resident']"
      ]
     },
     "execution_count": 108,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sortedusers[\"userName\"].to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "50fb31e9",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Scoring each account by the descriptions of their videos related to the war, ukraine and russia\n",
    "sai = SentimentIntensityAnalyzer()\n",
    "news=sortedusers[\"userName\"]\n",
    "for index, new in enumerate(news):\n",
    "    score=[]\n",
    "    query = \"\"\"\n",
    "    MATCH (u:user)-[a:author]->(v:video)\n",
    "    WHERE u.id =~ '%s' and\n",
    "          (v.desc =~ '.*ukraine.*' OR\n",
    "          v.desc =~ '.*war.*' OR \n",
    "          v.desc =~ '.*russia.*')\n",
    "    RETURN v.desc AS description; \n",
    "    \"\"\" % new\n",
    "    # the % new inserts value of new where the %s is in the WHERE statement\n",
    "    result=pd.DataFrame(graph.run(query).data())\n",
    "    if (len(result)!=0):\n",
    "        for sentence in result['description']:\n",
    "            lang = detect(sentence)\n",
    "            if lang=='en':\n",
    "                kvp = sai.polarity_scores(sentence)\n",
    "                score.append(kvp['compound'])\n",
    "        #print(new,'has mean sentiment score of', round(np.mean(score),3),'from', len(score),'videos')\n",
    "        #print()\n",
    "        sortedusers.at[index, \"Score\"]=round(np.mean(score),3)\n",
    "        \n",
    "    else:\n",
    "        print(new,'returned no results in video description')\n",
    "        print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "9df57c35",
   "metadata": {},
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "expected string or bytes-like object",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "Input \u001b[1;32mIn [79]\u001b[0m, in \u001b[0;36m<cell line: 5>\u001b[1;34m()\u001b[0m\n\u001b[0;32m     25\u001b[0m sortedusers\u001b[38;5;241m.\u001b[39mat[index, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mDescription score\u001b[39m\u001b[38;5;124m\"\u001b[39m]\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mround\u001b[39m(np\u001b[38;5;241m.\u001b[39mmean(score),\u001b[38;5;241m3\u001b[39m)\n\u001b[0;32m     26\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m sentence \u001b[38;5;129;01min\u001b[39;00m result[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124msticker\u001b[39m\u001b[38;5;124m'\u001b[39m]:\n\u001b[1;32m---> 27\u001b[0m     lang \u001b[38;5;241m=\u001b[39m \u001b[43mdetect\u001b[49m\u001b[43m(\u001b[49m\u001b[43msentence\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     28\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m lang\u001b[38;5;241m==\u001b[39m\u001b[38;5;124m'\u001b[39m\u001b[38;5;124men\u001b[39m\u001b[38;5;124m'\u001b[39m:\n\u001b[0;32m     29\u001b[0m         kvp \u001b[38;5;241m=\u001b[39m sai\u001b[38;5;241m.\u001b[39mpolarity_scores(sentence)\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\langdetect\\detector_factory.py:129\u001b[0m, in \u001b[0;36mdetect\u001b[1;34m(text)\u001b[0m\n\u001b[0;32m    127\u001b[0m init_factory()\n\u001b[0;32m    128\u001b[0m detector \u001b[38;5;241m=\u001b[39m _factory\u001b[38;5;241m.\u001b[39mcreate()\n\u001b[1;32m--> 129\u001b[0m \u001b[43mdetector\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mappend\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtext\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    130\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m detector\u001b[38;5;241m.\u001b[39mdetect()\n",
      "File \u001b[1;32mc:\\users\\arual\\appdata\\local\\programs\\python\\python39\\lib\\site-packages\\langdetect\\detector.py:104\u001b[0m, in \u001b[0;36mDetector.append\u001b[1;34m(self, text)\u001b[0m\n\u001b[0;32m     99\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mappend\u001b[39m(\u001b[38;5;28mself\u001b[39m, text):\n\u001b[0;32m    100\u001b[0m     \u001b[38;5;124;03m'''Append the target text for language detection.\u001b[39;00m\n\u001b[0;32m    101\u001b[0m \u001b[38;5;124;03m    If the total size of target text exceeds the limit size specified by\u001b[39;00m\n\u001b[0;32m    102\u001b[0m \u001b[38;5;124;03m    Detector.set_max_text_length(int), the rest is cut down.\u001b[39;00m\n\u001b[0;32m    103\u001b[0m \u001b[38;5;124;03m    '''\u001b[39;00m\n\u001b[1;32m--> 104\u001b[0m     text \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mURL_RE\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43msub\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43m \u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtext\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    105\u001b[0m     text \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mMAIL_RE\u001b[38;5;241m.\u001b[39msub(\u001b[38;5;124m'\u001b[39m\u001b[38;5;124m \u001b[39m\u001b[38;5;124m'\u001b[39m, text)\n\u001b[0;32m    106\u001b[0m     text \u001b[38;5;241m=\u001b[39m NGram\u001b[38;5;241m.\u001b[39mnormalize_vi(text)\n",
      "\u001b[1;31mTypeError\u001b[0m: expected string or bytes-like object"
     ]
    }
   ],
   "source": [
    "####PRUEBA#######\n",
    "##No compilar hasta saber como cambiar los valures null###\n",
    "#Scoring each account by the descriptions and stickers of their videos related to the war, ukraine and russia\n",
    "#Como lidiar con los missing stickers? \"null\"\n",
    "sai = SentimentIntensityAnalyzer()\n",
    "news=sortedusers[\"userName\"]\n",
    "for index, new in enumerate(news):\n",
    "    score=[]\n",
    "    query = \"\"\"\n",
    "    MATCH (u:user)-[a:author]->(v:video)\n",
    "    WHERE u.id =~ '%s' and\n",
    "          (v.desc =~ '.*ukraine.*' OR\n",
    "          v.desc =~ '.*war.*' OR \n",
    "          v.desc =~ '.*russia.*')\n",
    "    RETURN v.desc AS description, v.stickerText as sticker; \n",
    "    \"\"\" % new\n",
    "    # the % new inserts value of new where the %s is in the WHERE statement\n",
    "    result=pd.DataFrame(graph.run(query).data())\n",
    "    if (len(result)!=0):\n",
    "        for sentence in result['description']:\n",
    "            lang = detect(sentence)\n",
    "            if lang=='en':\n",
    "                kvp = sai.polarity_scores(sentence)\n",
    "                score.append(kvp['compound'])\n",
    "        #print(new,'has mean sentiment score of', round(np.mean(score),3),'from', len(score),'videos')\n",
    "        #print()\n",
    "        sortedusers.at[index, \"Description score\"]=round(np.mean(score),3)\n",
    "        for sentence in result['sticker']:\n",
    "            lang = detect(sentence)\n",
    "            if lang=='en':\n",
    "                kvp = sai.polarity_scores(sentence)\n",
    "                score.append(kvp['compound'])\n",
    "        #print(new,'has mean sentiment score of', round(np.mean(score),3),'from', len(score),'videos')\n",
    "        #print()\n",
    "        sortedusers.at[index, \"Sticker score\"]=round(np.mean(score),3)\n",
    "        \n",
    "    else:\n",
    "        print(new,'returned no results in video description or sticker')\n",
    "        print()\n",
    "        \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "480de23b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Streams</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>48940200</td>\n",
       "      <td>0.114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>1</td>\n",
       "      <td>41258500</td>\n",
       "      <td>-0.263</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>37147500</td>\n",
       "      <td>-0.053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>34132375</td>\n",
       "      <td>-0.173</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>31600000</td>\n",
       "      <td>-0.511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>xenasolo</td>\n",
       "      <td>0</td>\n",
       "      <td>30629200</td>\n",
       "      <td>0.097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>24747400</td>\n",
       "      <td>-0.254</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world247breakingnews</td>\n",
       "      <td>0</td>\n",
       "      <td>24664271</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>abc15arizona</td>\n",
       "      <td>1</td>\n",
       "      <td>23950384</td>\n",
       "      <td>0.045</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>matthewcassel</td>\n",
       "      <td>0</td>\n",
       "      <td>23114400</td>\n",
       "      <td>-0.331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>aaronparnas6</td>\n",
       "      <td>0</td>\n",
       "      <td>20800000</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>planefinder</td>\n",
       "      <td>1</td>\n",
       "      <td>19829600</td>\n",
       "      <td>-0.173</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>mihhail83</td>\n",
       "      <td>0</td>\n",
       "      <td>17416100</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>military_thingz</td>\n",
       "      <td>0</td>\n",
       "      <td>16800000</td>\n",
       "      <td>-0.100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>visegrad24</td>\n",
       "      <td>0</td>\n",
       "      <td>16694300</td>\n",
       "      <td>0.056</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>random.content99</td>\n",
       "      <td>0</td>\n",
       "      <td>15100801</td>\n",
       "      <td>0.122</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>politicsoftheworld</td>\n",
       "      <td>0</td>\n",
       "      <td>14466600</td>\n",
       "      <td>0.050</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>aviationhxb</td>\n",
       "      <td>0</td>\n",
       "      <td>13926300</td>\n",
       "      <td>-0.039</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsmornings</td>\n",
       "      <td>1</td>\n",
       "      <td>12221719</td>\n",
       "      <td>-0.198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>11974702</td>\n",
       "      <td>-0.077</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   userName  VerifiedAccount   Streams  Score\n",
       "0   president.putin.fanpage                0  48940200  0.114\n",
       "1             viceworldnews                1  41258500 -0.263\n",
       "2        bikini.bottom.news                0  37147500 -0.053\n",
       "3                   skynews                1  34132375 -0.173\n",
       "4               cheddygrace                0  31600000 -0.511\n",
       "5                  xenasolo                0  30629200  0.097\n",
       "6                   cbsnews                1  24747400 -0.254\n",
       "7      world247breakingnews                0  24664271  0.000\n",
       "8              abc15arizona                1  23950384  0.045\n",
       "9             matthewcassel                0  23114400 -0.331\n",
       "10             aaronparnas6                0  20800000  0.000\n",
       "11              planefinder                1  19829600 -0.173\n",
       "12                mihhail83                0  17416100  0.000\n",
       "13          military_thingz                0  16800000 -0.100\n",
       "14               visegrad24                0  16694300  0.056\n",
       "15         random.content99                0  15100801  0.122\n",
       "16       politicsoftheworld                0  14466600  0.050\n",
       "17              aviationhxb                0  13926300 -0.039\n",
       "18              cbsmornings                1  12221719 -0.198\n",
       "19           city__resident                0  11974702 -0.077"
      ]
     },
     "execution_count": 88,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sortedusers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "353bea8f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Streams</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>viceworldnews</td>\n",
       "      <td>1</td>\n",
       "      <td>41258500</td>\n",
       "      <td>-0.263</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>skynews</td>\n",
       "      <td>1</td>\n",
       "      <td>34132375</td>\n",
       "      <td>-0.173</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>cbsnews</td>\n",
       "      <td>1</td>\n",
       "      <td>24747400</td>\n",
       "      <td>-0.254</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>abc15arizona</td>\n",
       "      <td>1</td>\n",
       "      <td>23950384</td>\n",
       "      <td>0.045</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>planefinder</td>\n",
       "      <td>1</td>\n",
       "      <td>19829600</td>\n",
       "      <td>-0.173</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>cbsmornings</td>\n",
       "      <td>1</td>\n",
       "      <td>12221719</td>\n",
       "      <td>-0.198</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         userName  VerifiedAccount   Streams  Score\n",
       "1   viceworldnews                1  41258500 -0.263\n",
       "3         skynews                1  34132375 -0.173\n",
       "6         cbsnews                1  24747400 -0.254\n",
       "8    abc15arizona                1  23950384  0.045\n",
       "11    planefinder                1  19829600 -0.173\n",
       "18    cbsmornings                1  12221719 -0.198"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "VerifiedAccounts=sortedusers.loc[sortedusers['VerifiedAccount'] == 1]\n",
    "VerifiedAccounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "b272ea31",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-0.1693333333333333"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "VerifiedAccounts[\"Score\"].mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "0e0401b2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.045"
      ]
     },
     "execution_count": 91,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "VerifiedAccounts[\"Score\"].max()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "1e7bbc48",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userName</th>\n",
       "      <th>VerifiedAccount</th>\n",
       "      <th>Streams</th>\n",
       "      <th>Score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>president.putin.fanpage</td>\n",
       "      <td>0</td>\n",
       "      <td>48940200</td>\n",
       "      <td>0.114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>bikini.bottom.news</td>\n",
       "      <td>0</td>\n",
       "      <td>37147500</td>\n",
       "      <td>-0.053</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cheddygrace</td>\n",
       "      <td>0</td>\n",
       "      <td>31600000</td>\n",
       "      <td>-0.511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>xenasolo</td>\n",
       "      <td>0</td>\n",
       "      <td>30629200</td>\n",
       "      <td>0.097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>world247breakingnews</td>\n",
       "      <td>0</td>\n",
       "      <td>24664271</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>matthewcassel</td>\n",
       "      <td>0</td>\n",
       "      <td>23114400</td>\n",
       "      <td>-0.331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>aaronparnas6</td>\n",
       "      <td>0</td>\n",
       "      <td>20800000</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>mihhail83</td>\n",
       "      <td>0</td>\n",
       "      <td>17416100</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>military_thingz</td>\n",
       "      <td>0</td>\n",
       "      <td>16800000</td>\n",
       "      <td>-0.100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>visegrad24</td>\n",
       "      <td>0</td>\n",
       "      <td>16694300</td>\n",
       "      <td>0.056</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>random.content99</td>\n",
       "      <td>0</td>\n",
       "      <td>15100801</td>\n",
       "      <td>0.122</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>politicsoftheworld</td>\n",
       "      <td>0</td>\n",
       "      <td>14466600</td>\n",
       "      <td>0.050</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>aviationhxb</td>\n",
       "      <td>0</td>\n",
       "      <td>13926300</td>\n",
       "      <td>-0.039</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>city__resident</td>\n",
       "      <td>0</td>\n",
       "      <td>11974702</td>\n",
       "      <td>-0.077</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                   userName  VerifiedAccount   Streams  Score\n",
       "0   president.putin.fanpage                0  48940200  0.114\n",
       "2        bikini.bottom.news                0  37147500 -0.053\n",
       "4               cheddygrace                0  31600000 -0.511\n",
       "5                  xenasolo                0  30629200  0.097\n",
       "7      world247breakingnews                0  24664271  0.000\n",
       "9             matthewcassel                0  23114400 -0.331\n",
       "10             aaronparnas6                0  20800000  0.000\n",
       "12                mihhail83                0  17416100  0.000\n",
       "13          military_thingz                0  16800000 -0.100\n",
       "14               visegrad24                0  16694300  0.056\n",
       "15         random.content99                0  15100801  0.122\n",
       "16       politicsoftheworld                0  14466600  0.050\n",
       "17              aviationhxb                0  13926300 -0.039\n",
       "19           city__resident                0  11974702 -0.077"
      ]
     },
     "execution_count": 92,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "NoVerifiedAccounts=sortedusers.loc[sortedusers['VerifiedAccount'] == 0]\n",
    "NoVerifiedAccounts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "c7e4d7e8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "-0.047999999999999994"
      ]
     },
     "execution_count": 93,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "NoVerifiedAccounts[\"Score\"].mean()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "81e10cb2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.122"
      ]
     },
     "execution_count": 94,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "NoVerifiedAccounts[\"Score\"].max()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b597aeaa",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Bajo este análisis , los perfiles verficados condenan de forma más clara las acciones a través de su videos (descripciones)\n",
    "#mientras que los no verificados no siguen un perfil tan claro, habiendo mayor presencia de valores positivos "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "id": "09b54095",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Study the relationships and recommendations that the algorithm gives us from each of this profiles, to see if there's any\n",
    "#common account to most of them\n",
    "#Graph of the relations\n",
    "query = \"\"\"\n",
    "WITH ['president.putin.fanpage','viceworldnews','bikini.bottom.news','skynews','cheddygrace','xenasolo','cbsnews','world247breakingnews','abc15arizona','matthewcassel','aaronparnas6','planefinder','mihhail83','military_thingz','visegrad24','random.content99','politicsoftheworld','aviationhxb','cbsmornings','city__resident'] as users\n",
    " MATCH (u:user)-[r:recommends]->(a:user)\n",
    " WHERE u.id in users\n",
    " RETURN *\n",
    "\"\"\"\n",
    "graph.run(query);\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8ca64da9",
   "metadata": {},
   "outputs": [],
   "source": [
    "#List of the names of the recommended accounts\n",
    "query = \"\"\"\n",
    "WITH ['president.putin.fanpage','viceworldnews','bikini.bottom.news','skynews','cheddygrace','xenasolo','cbsnews','world247breakingnews','abc15arizona','matthewcassel','aaronparnas6','planefinder','mihhail83','military_thingz','visegrad24','random.content99','politicsoftheworld','aviationhxb','cbsmornings','city__resident'] as users\n",
    " MATCH (u:user)-[r:recommends]->(a:user)\n",
    " WHERE u.id in users \n",
    "RETURN a.id\n",
    "\"\"\"\n",
    "graph.run(query);\n",
    "\n",
    "#There are 595"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b3fdc3e6",
   "metadata": {},
   "outputs": [],
   "source": [
    "#I'm not able to thing how to filter or count the number of relations entering a node just taking into account the u being from \n",
    "# our list"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
